benjaminkravets/KW45B41Z/kw45b41zevk_eatt_central_bm/framework/NVM/source/NV_Flash.c
/******************************************************************************
 * Name: __NvModuleInit
 * Description: Initialize the NV storage module
 * Parameter(s): -
 * Return: gNVM_ModuleAlreadyInitialized_c - if the module is already
 *                                           initialized
 *         gNVM_InvalidSectorsCount_c - if the sector count configured in the
 *                                      project linker file is invalid
 *         gNVM_MetaNotFound_c - if no meta information was found
 *         gNVM_OK_c - module was successfully initialized
 *****************************************************************************/
NVM_STATIC NVM_Status_t __NvModuleInit(bool_t flashInit);

#if gUnmirroredFeatureSet_d

/******************************************************************************
 * Name: __NvmMoveToRam
 * Description: Move from NVM to Ram
 * Parameter(s):  ppData     double pointer to the entity to be moved from flash to RAM
 * Return: pointer to Ram location
 *****************************************************************************/
NVM_STATIC NVM_Status_t __NvmMoveToRam(void **ppData);

/******************************************************************************
 * Name: __NvmErase
 * Description: Erase from NVM an unmirrored dataset
 * Parameter(s):  ppData     double pointer to the entity to be erased
 * Return: pointer to Ram location
 *****************************************************************************/
NVM_STATIC NVM_Status_t __NvmErase(void **ppData);

/******************************************************************************
 * Name: NvIsNVMFlashAddress
 * Description: check if the address is in Flash
 * Parameter(s): [IN] address
 *
 * Return: TRUE if the table entry is in Flash / FALSE otherwise
 ******************************************************************************/
NVM_STATIC bool_t NvIsNVMFlashAddress(void *address);

/******************************************************************************
 * Name: __NvmRestoreUnmirrored
 * Description: Restores all unmirrored entries with gNVM_NotMirroredInRamAutoRestore_c at init
 * Parameter(s): -
 * Return: -
 *****************************************************************************/
NVM_STATIC void __NvmRestoreUnmirrored(void);
#endif

/******************************************************************************
 * Name: NvInitPendingSavesQueue
 * Description: Initialize the pending saves queue
 * Parameters: [IN] pQueue - pointer to queue
 * Return: none
 ******************************************************************************/
NVM_STATIC void NvInitPendingSavesQueue(NVM_SaveQueue_t *pQueue);

/******************************************************************************
 * Name: NvPushPendingSave
 * Description: Add a new pending save to the queue tail
 * Parameters: [IN] pQueue - pointer to queue
 *             [IN] data - data to be saved
 * Return: TRUE if the push operation succeeded, FALSE otherwise
 ******************************************************************************/
NVM_STATIC bool_t NvPushPendingSave(NVM_SaveQueue_t *pQueue, NVM_TableEntryInfo_t data);

/******************************************************************************
 * Name: NvGetPendingSaveHead
 * Description: Retrieves the head element from the pending saves queue leaving=
 *              it at head position. Also see NvPopPendingSave.
 * Parameters: [IN] pQueue - pointer to queue
 *             [OUT] pData - pointer to the location where data will be placed
 * Return: TRUE if the get head operation succeeded, FALSE otherwise
 ******************************************************************************/
NVM_STATIC bool_t NvGetPendingSaveHead(NVM_SaveQueue_t *pQueue, NVM_TableEntryInfo_t *pData);

/******************************************************************************
 * Name: NvRemovePendingSaveHead
 * Description: Consume pending save queue head by incrementing its head index.
 *              Also see NvPopPendingSave.
 * Parameters: [IN] pQueue - pointer to queue
 * Return: none
 ******************************************************************************/
NVM_STATIC void NvRemovePendingSaveHead(NVM_SaveQueue_t *pQueue);

/******************************************************************************
 * Name: NvLookAheadInPendingSaveQueue
 * Description: Search through pending save queue if an update is pending on the
 *              element designated by an id and index.
 *
 * Parameters: [IN] pQueue - pointer to queue
 *             [IN] searched_id
 *             [IN] searched_index
 *
 * Return: op_type of pending operation OP_NONE if not found,
 *         OP_SAVE_ALL or OP_SAVE_SINGLE if found
 ******************************************************************************/
NVM_STATIC uint8_t NvLookAheadInPendingSaveQueue(NVM_SaveQueue_t *pQueue,
                                                 uint16_t         searched_id,
                                                 uint16_t         searched_index);

/******************************************************************************
 * Name: NvPopPendingSave
 * Description: Retrieves the head element from the pending saves queue
 * Parameters: [IN] pQueue - pointer to queue
 *             [OUT] pData - pointer to the location where data will be placed
 * Return: TRUE if the pop operation succeeded, FALSE otherwise
 ******************************************************************************/
NVM_STATIC bool_t NvPopPendingSave(NVM_SaveQueue_t *pQueue, NVM_TableEntryInfo_t *pData);

/******************************************************************************
 * Name: NvGetPendingSavesCount
 * Description: self explanatory
 * Parameters: [IN] pQueue - pointer to queue
 * Return: Number of pending saves
 ******************************************************************************/
NVM_STATIC uint16_t NvGetPendingSavesCount(NVM_SaveQueue_t *pQueue);

/******************************************************************************
 * Name: UpgradeLegacyTable
 * Description: Upgrades an legacy table to the new format
 * Parameter(s): -
 * Return: -
 *****************************************************************************/
NVM_STATIC NVM_Status_t UpgradeLegacyTable(void);

