benjaminkravets/KW45B41Z/kw45b41zevk_eatt_central_bm/framework/NVM/source/NV_Flash.c
NVM_STATIC uint16_t mNVM_DataTableNbEntries = 0U;

#if gNvDualImageSupport
typedef union NVM_TableAndEntryInfo_tag
{
    NVM_TableInfo_t tableInfo;
    NVM_EntryInfo_t entryInfo;
} NVM_TableAndEntryInfo_t;

NVM_STATIC uint16_t NV_DiffEntryId[gNvTableEntriesCountMax_c];
NVM_STATIC uint16_t gNeedAddEntryCnt = 0U;

NVM_STATIC NVM_VirtualPageID_t gPreviousActivePageId = gVirtualPageNone_c;

#endif /* gNvDualImageSupport */
#endif /* gNvStorageIncluded_d */

/*****************************************************************************
 *****************************************************************************
 * Private functions
 *****************************************************************************
 *****************************************************************************/

#if gNvStorageIncluded_d
#if gNvUseExtendedFeatureSet_d
/******************************************************************************
 * Name: __NvRegisterTableEntry
 * Description: The function tries to register a new table entry within an
 *              existing NV table. If the NV table contained an erased (invalid)
 *              entry, the entry will be overwritten with a new one (provided
 *              by the mean of this function arguments)
 * Parameter(s): [IN] ptrData - generic pointer to RAM data to be registered
 *                              within the NV storage system
 *               [IN] uniqueId - an unique ID of the table entry
 *               [IN] elemCount - how many elements the table entry contains
 *               [IN] elemSize - the size of an element
 *               [IN] dataEntryType - the type of the new entry
 *               [IN] overwrite - if an existing table entry shall be
 *                                overwritten
 * Return: gNVM_OK_c - if the operation completes successfully
 *         gNVM_RegisterFailure_c - invalid id or unmirrored data set
 *         gNVM_AlreadyRegistered - the id is allready registered in another entry
 *         gNVM_ModuleNotInitialized_c - if the NVM  module is not initialized
 *****************************************************************************/
#if gNvTableKeptInRam_d
NVM_STATIC NVM_Status_t __NvRegisterTableEntry(void *           ptrData,
                                               NvTableEntryId_t uniqueId,
                                               uint16_t         elemCount,
                                               uint16_t         elemSize,
                                               uint16_t         dataEntryType,
                                               bool_t           overwrite)
{
    uint16_t     loopCnt = 0;
    uint16_t     nullPos = gNvTableEntriesCountMax_c;
    NVM_Status_t status;
    bool_t       ret = FALSE;

    if (!mNvModuleInitialized)
    {
        status = gNVM_ModuleNotInitialized_c;
    }
    else
    {
        if (gNvInvalidDataEntry_c == uniqueId)
        {
            status = gNVM_RegisterFailure_c;
        }
        else
        {
#if gNvFragmentation_Enabled_d
            if (elemCount > gNvRecordsCopiedBufferSize_c)
            {
                status = gNVM_DefragBufferTooSmall_c;
            }
            else
#endif
            {
                while (loopCnt < NVM_DataTableNbEntries)
                {
                    if ((pNVM_DataTable[loopCnt].pData == NULL) && (!overwrite))
                    {
                        nullPos = loopCnt;
                        break;
                    }

                    if (pNVM_DataTable[loopCnt].DataEntryID == uniqueId)
                    {
                        if (overwrite)
                        {
                            /* make sure that the NvWriteRamTable writes the updated values */
                            pNVM_DataTable[loopCnt].pData         = ptrData;
                            pNVM_DataTable[loopCnt].ElementsCount = elemCount;
                            pNVM_DataTable[loopCnt].ElementSize   = elemSize;
                            pNVM_DataTable[loopCnt].DataEntryType = dataEntryType;
                            /*force page copy first*/
                            status = __NvEraseEntryFromStorage(uniqueId, loopCnt);
                        }
                        else
                        {
                            status = gNVM_AlreadyRegistered;
                        }
                        ret = TRUE;
                        break;
                    }
                    /* increment the loop counter */
                    loopCnt++;
                }

                if (FALSE == ret)
                {
                    if (gNvTableEntriesCountMax_c != nullPos)
                    {
                        pNVM_DataTable[nullPos].pData         = ptrData;
                        pNVM_DataTable[nullPos].DataEntryID   = uniqueId;
                        pNVM_DataTable[nullPos].ElementsCount = elemCount;
                        pNVM_DataTable[nullPos].ElementSize   = elemSize;
                        pNVM_DataTable[nullPos].DataEntryType = dataEntryType;

                        /* postpone the operation */
                        if (mNvCriticalSectionFlag)
                        {
                            mNvCopyOperationIsPending = TRUE;
                            status                    = gNVM_CriticalSectionActive_c;
                        }
                        else
                        {
/*update the flash table*/
#if (((defined(gFsciIncluded_c)) && (gFsciIncluded_c > 0U)) && \
     ((defined(gNvmEnableFSCIMonitoring_c)) && (gNvmEnableFSCIMonitoring_c > 0U)))
                            FSCI_MsgNVVirtualPageMonitoring(TRUE, gNVM_OK_c);
                            FSCI_MsgNVVirtualPageMonitoring(FALSE, status = NvCopyPage(gNvCopyAll_c));
#else
                            status = NvCopyPage(gNvCopyAll_c);
#endif
                        }
                    }
                    else
                    {
                        status = gNVM_RegisterFailure_c;
                    }
                }
            }
        }
    }
    return status;
}
#endif // gNvTableKeptInRam_d

