benjaminkravets/KW45B41Z/kw45b41zevk_eatt_central_bm/framework/NVM/source/NV_Flash.c
/******************************************************************************
 * Name: GetFlashTableVersion
 * Description: returns the flash table version
 * Parameter(s): -
 * Return: 0 or flash table version
 *****************************************************************************/
uint16_t GetFlashTableVersion(void)
{
    uint16_t ret = 0U;
    InitNVMConfig();
    if (gVirtualPageNone_c != mNvActivePageId)
    {
        ret = (*(NVM_TableInfo_t *)(mNvVirtualPageProperty[mNvActivePageId].NvRawSectorStartAddress))
                  .fields.NvTableVersion;
    }
    return ret;
}

/******************************************************************************
 * Name: __NvEraseEntryFromStorage
 * Description: The function removes a table entry within the existing NV
 *              table. The RAM table must be updated before this call.
 * Parameter(s): [IN] entryId - the entry id of the entry that is removed
 *               [IN] tableEntryIndex - the index of the entry in the ram table
 * Return: gNVM_OK_c - if the operation completes successfully
 *         gNVM_ModuleNotInitialized_c - if the NVM  module is not initialized
 *         gNVM_NullPointer_c - if a NULL pointer is provided
 *****************************************************************************/
#if gNvTableKeptInRam_d
NVM_STATIC NVM_Status_t __NvEraseEntryFromStorage(uint16_t entryId, uint16_t tableEntryIndex)
{
    uint16_t     loopCnt;
    NVM_Status_t status = gNVM_OK_c;
    uint16_t     remaining_count;

    if (!mNvModuleInitialized)
    {
        status = gNVM_ModuleNotInitialized_c;
    }
    else
    {
        /* Check if is in pending queue - if yes than remove it */
        if (NvIsPendingOperation())
        {
            /* Start from the queue's head */
            loopCnt         = mNvPendingSavesQueue.Head;
            remaining_count = mNvPendingSavesQueue.EntriesCount;

            while (remaining_count)
            {
                if (entryId == mNvPendingSavesQueue.QData[loopCnt].entryId)
                {
                    mNvPendingSavesQueue.QData[loopCnt].entryId = gNvInvalidDataEntry_c;
                }
                remaining_count--;
                /* increment and wrap the loop index */
                if (++loopCnt >= (uint8_t)gNvPendingSavesQueueSize_c)
                {
                    loopCnt = 0;
                }
            }
        }
        maDatasetInfo[tableEntryIndex].countsToNextSave = gNvCountsBetweenSaves;
        maDatasetInfo[tableEntryIndex].saveNextInterval = FALSE;

        /* postpone the operation */
        if (mNvCriticalSectionFlag)
        {
            mNvCopyOperationIsPending = TRUE;
            status                    = gNVM_CriticalSectionActive_c;
        }
        else
        {
            /* erase the table entry by making a copy of the active page to the inactive one,
             * but skipping while copying the table entry to be erased */
            if (gEmptyPageMetaAddress_c != mNvVirtualPageProperty[mNvActivePageId].NvLastMetaInfoAddress)
            {
#if (((defined(gFsciIncluded_c)) && (gFsciIncluded_c > 0U)) && \
     ((defined(gNvmEnableFSCIMonitoring_c)) && (gNvmEnableFSCIMonitoring_c > 0U)))
                FSCI_MsgNVVirtualPageMonitoring(TRUE, gNVM_OK_c);
                FSCI_MsgNVVirtualPageMonitoring(FALSE, status = NvCopyPage(entryId));
#else
                status = NvCopyPage(entryId);
#endif
            }
        }
    }
    return status;
}
#endif // gNvTableKeptInRam_d

/******************************************************************************
 * Name: RecoverNvEntry
 * Description: Reads a flash entry so that the application can handle dynamic entries.
 * Parameter(s): [IN] index - the ram entry index
 *               [OUT] entry - the flash entry at the specified index
 * Return: gNVM_OK_c - if the operation completes successfully
           gNVM_RestoreFailure_c - if the operation failed
           gNVM_AddressOutOfRange_c - if the index is too large
           gNVM_Error_c - not supported, NVM table is stored in FLASH
 *****************************************************************************/
NVM_Status_t RecoverNvEntry(uint16_t index, NVM_DataEntry_t *entry)
{
#if gNvTableKeptInRam_d

    uint32_t        addr;
    NVM_EntryInfo_t entryInfo;
    NVM_Status_t    status = gNVM_OK_c;

    entry->pData = NULL;
    InitNVMConfig();
    if (mNvActivePageId == gVirtualPageNone_c)
    {
        status = gNVM_RestoreFailure_c;
    }
    else
    {
        if (index * sizeof(NVM_EntryInfo_t) >= mNvTableSizeInFlash)
        {
            status = gNVM_AddressOutOfRange_c;
        }
        else
        {
            addr = mNvVirtualPageProperty[mNvActivePageId].NvRawSectorStartAddress + sizeof(NVM_TableInfo_t) +
                   index * sizeof(NVM_EntryInfo_t);
            NV_FlashRead(addr, (uint8_t *)&entryInfo, sizeof(NVM_EntryInfo_t));
            entry->DataEntryID   = entryInfo.fields.NvDataEntryID;
            entry->DataEntryType = entryInfo.fields.NvDataEntryType;
            entry->ElementsCount = entryInfo.fields.NvElementsCount;
            entry->ElementSize   = entryInfo.fields.NvElementSize;
        }
    }
    return status;
#else  /*gNvTableKeptInRam_d*/
    return gNVM_Error_c;
#endif /*gNvTableKeptInRam_d*/
}

/******************************************************************************
 * Name: NvIsRamTableUpdated
 * Description: Checks if the the NV table from RAM memory has changed since
 *              last system reset (e.g. via an OTA transfer)
 * Parameter(s): -
 * Return: TRUE if the NV RAM table has been changed / FALSE otherwise
 ******************************************************************************/
NVM_STATIC bool_t NvIsRamTableUpdated(void)
{
    uint16_t        idx;
    uint32_t        addr;
    uint32_t        endAddr;
    bool_t          idFound;
    bool_t          ret = FALSE;
    NVM_EntryInfo_t entryInfo;

    /* address = page raw sector start address + page counter size + table marker + table version */
    addr = mNvVirtualPageProperty[mNvActivePageId].NvRawSectorStartAddress + sizeof(NVM_TableInfo_t);

    /* compute the search end address */
    endAddr = addr + mNvTableSizeInFlash;

    do
    {
        /* read ID */
        NV_FlashRead((uint32_t *)addr, (uint8_t *)&entryInfo, sizeof(NVM_EntryInfo_t));

        idFound = FALSE;
        idx     = 0;

        while (idx < mNVM_DataTableNbEntries)
        {
            if (entryInfo.fields.NvDataEntryID == pNVM_DataTable[idx].DataEntryID)
            {
                idFound = TRUE;
                break;
            }

            /* increment the index */
            idx++;
        }
#if gNvDualImageSupport

        if (!idFound)
        {
            /* If entry from NVM is not found in entry from RAM, not need to update it as this entry is save by other
             * application */
        }
        else
        {
#else  /* gNvDualImageSupport */
        if (!idFound)
        {
            ret = TRUE;
            break;
        }
#endif /* gNvDualImageSupport */
            if ((((uint16_t)gNVM_MirroredInRam_c == entryInfo.fields.NvDataEntryType) ||
                 ((uint16_t)gNVM_MirroredInRam_c == pNVM_DataTable[idx].DataEntryType)) &&
                (entryInfo.fields.NvDataEntryType != pNVM_DataTable[idx].DataEntryType))
            {
                ret = TRUE;
                break;
            }
            if ((entryInfo.fields.NvElementsCount != pNVM_DataTable[idx].ElementsCount) ||
                (entryInfo.fields.NvElementSize != pNVM_DataTable[idx].ElementSize))
            {
                ret = TRUE;
                break;
            }
#if gNvDualImageSupport
        }
#endif /* gNvDualImageSupport */

        /* increment the address */
        addr += sizeof(NVM_EntryInfo_t);

    } while (addr < endAddr);

    return ret;
}
/******************************************************************************
 * Name: NvGetTableEntry
 * Description: get the NV table entry information stored on FLASH memory
 * Parameter(s): [IN] tblEntryId - table entry ID
 *               [OUT] pDataEntry - a pointer to a memory location where the
 *                                  entry information will be stored
 * Return: TRUE if the has been found / FALSE otherwise
 ******************************************************************************/
NVM_STATIC bool_t NvGetTableEntry(uint16_t tblEntryId, NVM_DataEntry_t *pDataEntry)
{
    uint32_t        addr;
    NVM_EntryInfo_t tmp;
    NVM_TableInfo_t table;
    bool_t          ret = FALSE;

    pDataEntry->pData = NULL; /* the data pointer is not saved on FLASH table and
                               * shall not be used by the caller of this function */

    addr = mNvVirtualPageProperty[mNvActivePageId].NvRawSectorStartAddress;

    NV_FlashRead((uint32_t *)addr, &tmp, sizeof(NVM_TableInfo_t));
    table.rawValue = tmp.rawValue;
    if (mNvTableMarker == table.fields.NvTableMarker)
    {
        /* increment address */
        addr += sizeof(NVM_TableInfo_t);

        do
        {
            NV_FlashRead((uint32_t *)addr, &tmp, sizeof(NVM_EntryInfo_t));
            table.rawValue = tmp.rawValue;
            if (table.fields.NvTableMarker == mNvTableMarker)
            {
                /* reached end of table */
                break;
            }
            if (tmp.fields.NvDataEntryID == tblEntryId)
            {
                pDataEntry->DataEntryID   = tmp.fields.NvDataEntryID;
                pDataEntry->DataEntryType = tmp.fields.NvDataEntryType;
                pDataEntry->ElementsCount = tmp.fields.NvElementsCount;
                pDataEntry->ElementSize   = tmp.fields.NvElementSize;
                ret                       = TRUE;
                break;
            }

