benjaminkravets/KW45B41Z/kw45b41zevk_eatt_central_bm/framework/NVM/source/NV_Flash.c
            /* continue searching */
            addr += sizeof(NVM_EntryInfo_t);
        } while (addr < mNvVirtualPageProperty[mNvActivePageId].NvRawSectorEndAddress);
    }

    if (FALSE == ret)
    {
        pDataEntry->DataEntryType = 0;
        pDataEntry->ElementsCount = 0;
        pDataEntry->ElementSize   = 0;
        pDataEntry->DataEntryID   = gNvInvalidDataEntry_c;
    }
    return ret;
}

/******************************************************************************
 * Name: NvGetFlashTableSize
 * Description: Retrieves the size of the NV table
 * Parameter(s): -
 * Return: the NV table size
 ******************************************************************************/
NVM_STATIC uint32_t NvGetFlashTableSize(void)
{
    uint32_t        addr;
    uint32_t        size = 0U;
    NVM_TableInfo_t tableInfo;

    /* compute the size of the table stored in Flash memory */
    addr = mNvVirtualPageProperty[mNvActivePageId].NvRawSectorStartAddress;

    NV_FlashRead((uint32_t *)addr, (uint8_t *)&tableInfo, sizeof(NVM_TableInfo_t));

    if (gNvTableMarker_c == tableInfo.fields.NvTableMarker)
    {
        addr += sizeof(NVM_TableInfo_t);

        do
        {
            NV_FlashRead((uint32_t *)addr, (uint8_t *)&tableInfo, sizeof(NVM_TableInfo_t));

            if (gNvTableMarker_c == tableInfo.fields.NvTableMarker)
            {
                break;
            }
            size += sizeof(NVM_TableInfo_t);
            addr += sizeof(NVM_TableInfo_t);

        } while (addr < mNvVirtualPageProperty[mNvActivePageId].NvRawSectorEndAddress);
    }
    return size;
}

#if gNvDualImageSupport
NVM_STATIC uint32_t NvGetEntryInfoNeedToAddInNVM(void)
{
    uint16_t                i, j;
    uint32_t                addr, endAddr;
    bool_t                  isDiffEntry;
    NVM_TableAndEntryInfo_t tableAndEntryInfo;
    uint16_t                NV_AllNVMEntryId[gNvTableEntriesCountMax_c];
    uint16_t                gAllNVMEntryCnt = 0;

    /* compute the size of the Entry stored in Flash memory */
    addr             = mNvVirtualPageProperty[mNvActivePageId].NvRawSectorStartAddress;
    gNeedAddEntryCnt = 0;
    NV_FlashRead((uint32_t *)addr, (uint8_t *)&tableAndEntryInfo, sizeof(NVM_TableInfo_t));

    if (gNvTableMarker_c == tableAndEntryInfo.tableInfo.fields.NvTableMarker)
    {
        addr += sizeof(NVM_TableInfo_t);
        endAddr = addr + mNvTableSizeInFlash;
        /* Get all Entry ID from NVM*/
        do
        {
            NV_FlashRead((uint32_t *)addr, (uint8_t *)&tableAndEntryInfo, sizeof(NVM_TableInfo_t));

            if (gNvTableMarker_c == tableAndEntryInfo.tableInfo.fields.NvTableMarker)
            {
                break;
            }

            if (tableAndEntryInfo.entryInfo.fields.NvDataEntryID != gNvInvalidTableEntryIndex_c)
            {
                NV_AllNVMEntryId[gAllNVMEntryCnt++] = tableAndEntryInfo.entryInfo.fields.NvDataEntryID;
            }
            addr += sizeof(NVM_TableInfo_t);
        } while (addr < endAddr);

        i = 0;
        assert(NULL != pNVM_DataTable);
        while (i < mNVM_DataTableNbEntries)
        {
            j           = 0;
            isDiffEntry = TRUE;
            for (j = 0; j < gAllNVMEntryCnt; j++)
            {
                if (pNVM_DataTable[i].DataEntryID == NV_AllNVMEntryId[j])
                {
                    isDiffEntry = FALSE;
                    break;
                }
            }

            if (isDiffEntry)
            {
                NV_DiffEntryId[gNeedAddEntryCnt++] = pNVM_DataTable[i].DataEntryID;
            }
            i++;
        }
    }

    return gNeedAddEntryCnt;
}

NVM_STATIC bool_t NvSaveAllDataSetEntry(uint32_t *pDstAddr)
{
    uint64_t        tmp;
    uint32_t        srcStartAddr;
    uint32_t        srcEndAddr;
    NVM_EntryInfo_t entryInfo;

    uint16_t idx, DifIdx;
    bool_t   isSameEntryFoundInRam; //, isRemainEntry;
    bool_t   isSaveError;
    bool_t   ret = FALSE;

    if (gPreviousActivePageId != gVirtualPageNone_c)
    {
        /* startAddr = page raw sector start address + page counter size + table marker + table version */
        srcStartAddr = mNvVirtualPageProperty[gPreviousActivePageId].NvRawSectorStartAddress + sizeof(NVM_TableInfo_t);
        /* compute the search end address */
        srcEndAddr = srcStartAddr + mNvTableSizeInFlash;

        do
        {
            /* read NV table entry info */
            NV_FlashRead((uint32_t *)srcStartAddr, (uint8_t *)&entryInfo, sizeof(NVM_EntryInfo_t));
            isSameEntryFoundInRam = FALSE;
            idx                   = 0;
            while (idx < mNVM_DataTableNbEntries)
            {
                assert(NULL != pNVM_DataTable);
                if (pNVM_DataTable[idx].DataEntryID == entryInfo.fields.NvDataEntryID)
                {
                    /* we use entry info from RAM */
                    tmp = ((NVM_EntryInfo_t){.fields.NvDataEntryID   = pNVM_DataTable[idx].DataEntryID,
                                             .fields.NvDataEntryType = pNVM_DataTable[idx].DataEntryType,
                                             .fields.NvElementsCount = pNVM_DataTable[idx].ElementsCount,
                                             .fields.NvElementSize   = pNVM_DataTable[idx].ElementSize})
                              .rawValue;
                    isSameEntryFoundInRam = TRUE;
                }
                /* increment table entry index */
                idx++;
            }

            if (!isSameEntryFoundInRam)
            {
                /* we use entry info from NVM  */
                tmp = ((NVM_EntryInfo_t){.fields.NvDataEntryID   = entryInfo.fields.NvDataEntryID,
                                         .fields.NvDataEntryType = entryInfo.fields.NvDataEntryType,
                                         .fields.NvElementsCount = entryInfo.fields.NvElementsCount,
                                         .fields.NvElementSize   = entryInfo.fields.NvElementSize})
                          .rawValue;
            }

            if (kStatus_HAL_Flash_Success != HAL_FlashProgram(*pDstAddr, sizeof(NVM_EntryInfo_t), (uint8_t *)(&tmp)))
            {
                ret = TRUE;
                break;
            }

            /* increment address */
            *pDstAddr += sizeof(NVM_EntryInfo_t);
            srcStartAddr += sizeof(NVM_EntryInfo_t);
        } while (srcStartAddr < srcEndAddr);
    }

    {
        /* Previous we save all NV Entry from NVM, and part of NV Entry from RAM which have same entry ID as from NVM
           also saved, next step we save remain NV Entry from RAM */
        if (gNeedAddEntryCnt != 0)
        {
            idx         = 0;
            DifIdx      = 0;
            isSaveError = FALSE;
            while (idx < mNVM_DataTableNbEntries)
            {
                for (DifIdx = 0; DifIdx < gNeedAddEntryCnt; DifIdx++)
                {
                    /* different Enrty from NVM are also saved */
                    if (NV_DiffEntryId[DifIdx] == pNVM_DataTable[idx].DataEntryID)
                    {
                        /* we use entry info from RAM */
                        tmp = ((NVM_EntryInfo_t){.fields.NvDataEntryID   = pNVM_DataTable[idx].DataEntryID,
                                                 .fields.NvDataEntryType = pNVM_DataTable[idx].DataEntryType,
                                                 .fields.NvElementsCount = pNVM_DataTable[idx].ElementsCount,
                                                 .fields.NvElementSize   = pNVM_DataTable[idx].ElementSize})
                                  .rawValue;

                        if (kStatus_HAL_Flash_Success !=
                            HAL_FlashProgram(*pDstAddr, sizeof(NVM_EntryInfo_t), (uint8_t *)(&tmp)))
                        {
                            isSaveError = TRUE;
                            break;
                        }
                        *pDstAddr += sizeof(NVM_EntryInfo_t);
                    }
                }
                if (isSaveError)
                {
                    ret = TRUE;
                    break;
                }
                /* increment table entry index */
                idx++;
            }

            if (!isSaveError)
            {
                gNeedAddEntryCnt = 0;
            }
        }
    }

    return ret;
}

#endif /* gNvDualImageSupport */

#endif /* gNvUseExtendedFeatureSet_d */

