benjaminkravets/KW45B41Z/kw45b41zevk_eatt_central_bm/framework/NVM/source/NV_Flash.c
                            /* erase old page */
                            status = NvEraseVirtualPage(mNvErasePgCmdStatus.NvPageToErase);
                            if (gNVM_OK_c == status)
                            {
                                mNvVirtualPageProperty[mNvErasePgCmdStatus.NvPageToErase].NvLastMetaInfoAddress =
                                    gEmptyPageMetaAddress_c;
                                mNvErasePgCmdStatus.NvErasePending = FALSE;
                                /* write record */
                                status = NvWriteRecord(&tblIdx);
                            }
                        }
                    }
                }
            }
        }
    }

    return status;
}

/******************************************************************************
 * Name: __NvFormat
 * Description: Format the NV storage system. The function erases both virtual
 *              pages and then writes the page counter/ram table to active page.
 * Parameter(s): -
 * Return: gNVM_OK_c - if the operation completes successfully
 *         gNVM_FormatFailure_c - if the format operation fails
 *         gNVM_ModuleNotInitialized_c - if the NVM  module is not initialized
 *         gNVM_CriticalSectionActive_c - if the system has entered in a
 *                                        critical section
 *****************************************************************************/
NVM_STATIC NVM_Status_t __NvFormat(void)
{
    NVM_Status_t    status = gNVM_OK_c;
    NVM_TableInfo_t tableInfo;
#if gUnmirroredFeatureSet_d
    uint16_t loopCnt;
    uint16_t loopCnt2;
#endif

    if (!mNvModuleInitialized)
    {
        status = gNVM_ModuleNotInitialized_c;
    }
    else
    {
        if (mNvCriticalSectionFlag != 0u)
        {
            status = gNVM_CriticalSectionActive_c;
        }
        else
        {
            NV_FlashRead((uint32_t *)mNvVirtualPageProperty[mNvActivePageId].NvRawSectorStartAddress,
                         (uint8_t *)&tableInfo, sizeof(NVM_TableInfo_t));

            status = NvInternalFormat((uint32_t)tableInfo.fields.NvPageCounter);
            if (gNVM_OK_c == status)
            {
#if gUnmirroredFeatureSet_d
                {
                    for (loopCnt = 0; loopCnt < mNVM_DataTableNbEntries; loopCnt++)
                    {
                        maDatasetInfo[loopCnt].countsToNextSave = mNvCountsBetweenSaves;
                        maDatasetInfo[loopCnt].saveNextInterval = FALSE;
                        if ((NVM_DataEntryType_t)pNVM_DataTable[loopCnt].DataEntryType != gNVM_MirroredInRam_c)
                        {
                            for (loopCnt2 = 0; loopCnt2 < pNVM_DataTable[loopCnt].ElementsCount; loopCnt2++)
                            {
                                if (NvIsNVMFlashAddress(((void **)pNVM_DataTable[loopCnt].pData)[loopCnt2]))
                                {
                                    ((void **)pNVM_DataTable[loopCnt].pData)[loopCnt2] = NULL;
                                }
                            }
                        }
                    }
                }
#endif
                /* clear the save queue */
                NvInitPendingSavesQueue(&mNvPendingSavesQueue);
            }
        }
    }
    return status;
}

/******************************************************************************
 * Name: __NvIdle
 * Description: Called from the idle task (bare-metal) or NVM_Task (MQX,
 *              FreeRTOS) to process the pending saves, erase or copy
 *              operations.
 * Parameters: -
 * Return: Number of operations executed.
 ******************************************************************************/
NVM_STATIC int __NvIdle(void)
{
    NVM_TableEntryInfo_t tblIdx;
    int                  nb_operation = 0;
    NVM_Status_t         status;
    bool_t               ret = FALSE;

    uint64_t currentTimestampValue = 0;

#if gNvmUseTimerJitter_d
    uint8_t timerJitter = 0;
#endif

    if (mNvModuleInitialized && (mNvCriticalSectionFlag == 0u))
    {
        if (mNvCopyOperationIsPending)
        {
#if (((defined(gFsciIncluded_c)) && (gFsciIncluded_c > 0U)) && \
     ((defined(gNvmEnableFSCIMonitoring_c)) && (gNvmEnableFSCIMonitoring_c > 0U)))
            FSCI_MsgNVVirtualPageMonitoring(TRUE, gNVM_OK_c);
            FSCI_MsgNVVirtualPageMonitoring(FALSE, status = NvCopyPage(gNvCopyAll_c));
#else
            status = NvCopyPage(gNvCopyAll_c);
#endif
            if (gNVM_OK_c == status)
            {
                mNvCopyOperationIsPending = FALSE;
            }
        }

        if (mNvErasePgCmdStatus.NvErasePending)
        {
            if (mNvErasePgCmdStatus.NvSectorAddress >=
                mNvVirtualPageProperty[mNvErasePgCmdStatus.NvPageToErase].NvRawSectorEndAddress)
            {
                /* all sectors of the page had been erased */
                mNvVirtualPageProperty[mNvErasePgCmdStatus.NvPageToErase].NvLastMetaInfoAddress =
                    gEmptyPageMetaAddress_c;
                mNvErasePgCmdStatus.NvErasePending = FALSE;
#if (((defined(gFsciIncluded_c)) && (gFsciIncluded_c > 0U)) && \
     ((defined(gNvmEnableFSCIMonitoring_c)) && (gNvmEnableFSCIMonitoring_c > 0U)))
                FSCI_MsgNVPageEraseMonitoring(
                    mNvVirtualPageProperty[mNvErasePgCmdStatus.NvPageToErase].NvRawSectorStartAddress, gNVM_OK_c);
#endif
                ret = TRUE;
            }
            else
            {
                /* erase */
                (void)HAL_FlashEraseSector(mNvErasePgCmdStatus.NvSectorAddress,
                                           (uint32_t)((uint8_t *)NV_STORAGE_SECTOR_SIZE));

                /* blank check */
                if (kStatus_HAL_Flash_Success == HAL_FlashVerifyErase(mNvErasePgCmdStatus.NvSectorAddress,
                                                                      (uint32_t)NV_STORAGE_SECTOR_SIZE,
                                                                      kHAL_Flash_MarginValueNormal))

                {
                    mNvErasePgCmdStatus.NvSectorAddress += (uint32_t)((uint8_t *)NV_STORAGE_SECTOR_SIZE);
                    ret = TRUE;
                }
            }
        }
        if (FALSE == ret)
        {
            /* process the save-on-interval requests */
            if (mNvSaveOnIntervalEvent)
            {
#if gNvmUseTimerJitter_d
                timerJitter = GetRandomRange(0, 100);
#endif
                currentTimestampValue = TM_GetTimestamp();
#if gNvmUseTimerJitter_d
                if (currentTimestampValue - mNvLastTimestampValue >=
                    (uint64_t)((gNvOneSecondInMicros_c + ((uint64_t)timerJitter * (uint64_t)gNvJitterMultiplier_c)) -
                               (gNvJitterDecrement_c)))
#else
                if (currentTimestampValue - mNvLastTimestampValue >= (uint64_t)gNvOneSecondInMicros_c)
#endif
                {
                    mNvSaveOnIntervalEvent = __NvTimerTick(TRUE);
                    mNvLastTimestampValue  = currentTimestampValue;
                }
            }

            /* process the save-on-idle requests */
            while (
                NvGetPendingSaveHead(&mNvPendingSavesQueue,
                                     &tblIdx)) /* so long as we find something in Head, there are pendaing operations */
            {
                if ((gNvCopyAll_c == tblIdx.entryId) && (gNvCopyAll_c == tblIdx.elementIndex) &&
                    (OP_SAVE_ALL == tblIdx.op_type))
                {
                    (void)__NvAtomicSave();
                    NvRemovePendingSaveHead(&mNvPendingSavesQueue);
                    continue;
                }
                else if (gNvInvalidDataEntry_c == tblIdx.entryId)
                {
                    NvRemovePendingSaveHead(&mNvPendingSavesQueue);
                    continue;
                }
                else
                {
                    /*MISRA rule 15.7*/
                }

                if (NvWriteRecord(&tblIdx) == gNVM_PageCopyPending_c)
                {
                    /* was left in queue : do not add again and reorder write */
                    break;
                }
                NvRemovePendingSaveHead(&mNvPendingSavesQueue);
                nb_operation++;
            }
        }
    }
    return nb_operation;
}
/******************************************************************************
 * Name: __NvIsDataSetDirty
 * Description: return TRUE if the element pointed by ptrData is dirty
 * Parameters: [IN] ptrData - pointer to data to be checked
 * Return: TRUE if the element is dirty, FALSE otherwise
 ******************************************************************************/
bool_t __NvIsDataSetDirty(void *ptrData)
{
    NVM_TableEntryInfo_t tblIdx;
    uint16_t             tableEntryIdx;
    uint16_t             loopIdx;
    uint16_t             remaining_count;
    bool_t               ret = FALSE;

    if (mNvModuleInitialized)
    {
        if (NULL != ptrData)
        {
            if (gNVM_OK_c == NvGetTableEntryIndexFromDataPtr(ptrData, &tblIdx, &tableEntryIdx))
            {
                /* Check if is in pendding queue */
                if (mNvPendingSavesQueue.EntriesCount != 0u)
                {
                    /* Start from the queue's head */
                    loopIdx         = mNvPendingSavesQueue.Head;
                    remaining_count = mNvPendingSavesQueue.EntriesCount;

                    while (remaining_count != 0u)
                    {
                        if (mNvPendingSavesQueue.QData[loopIdx].entryId == tblIdx.entryId)
                        {
                            ret = TRUE;
                            break;
                        }
                        remaining_count--;
                        /* increment and wrap the loop index */
                        if (++loopIdx >= (uint8_t)gNvPendingSavesQueueSize_c)
                        {
                            loopIdx = 0;
                        }
                    }
                }
                if (FALSE == ret)
                {
                    ret = maDatasetInfo[tableEntryIdx].saveNextInterval;
                }
            }
        }
    }
    return ret;
}
/******************************************************************************
 * Name: __NvRestoreDataSet
 * Description: copy the most recent version of the element/table entry pointed
 *              by ptrData from NVM storage system to RAM memory
 * Parameter(s): [IN] ptrData - pointer to data (element) to be restored
 *               [IN] restoreAll - if FALSE restores a single element
 *                               - if TRUE restores an entire table entry
 * Return: status of the restore operation
 *****************************************************************************/
NVM_STATIC NVM_Status_t __NvRestoreDataSet(void *ptrData, bool_t restoreAll)
{
    NVM_TableEntryInfo_t tblIdx;
#if gUnmirroredFeatureSet_d
    uint16_t tableEntryIdx;
#endif
    NVM_Status_t nvmStatus;

    if (!mNvModuleInitialized)
    {
#if (((defined(gFsciIncluded_c)) && (gFsciIncluded_c > 0U)) && \
     ((defined(gNvmEnableFSCIMonitoring_c)) && (gNvmEnableFSCIMonitoring_c > 0U)))
        FSCI_MsgNVRestoreMonitoring(0, TRUE, (uint8_t)gNVM_ModuleNotInitialized_c);
#endif
        nvmStatus = gNVM_ModuleNotInitialized_c;
    }
    else
    {
        if (NULL == ptrData)
        {
#if (((defined(gFsciIncluded_c)) && (gFsciIncluded_c > 0U)) && \
     ((defined(gNvmEnableFSCIMonitoring_c)) && (gNvmEnableFSCIMonitoring_c > 0U)))
            FSCI_MsgNVRestoreMonitoring(0, TRUE, (uint8_t)gNVM_NullPointer_c);
#endif
            nvmStatus = gNVM_NullPointer_c;
        }
        else
        {
#if gNvFragmentation_Enabled_d
            tblIdx.op_type = restoreAll ? OP_SAVE_ALL : OP_SAVE_SINGLE;
#else
            tblIdx.op_type = OP_SAVE_ALL;
#endif /* gNvFragmentation_Enabled_d */
            /* get table and element indexes */
            if (gNVM_OK_c != NvGetEntryFromDataPtr(ptrData, &tblIdx))
            {
#if (((defined(gFsciIncluded_c)) && (gFsciIncluded_c > 0U)) && \
     ((defined(gNvmEnableFSCIMonitoring_c)) && (gNvmEnableFSCIMonitoring_c > 0U)))
                FSCI_MsgNVRestoreMonitoring(tblIdx.entryId, TRUE, (uint8_t)gNVM_PointerOutOfRange_c);
#endif
                nvmStatus = gNVM_PointerOutOfRange_c;
            }
            else
            {
#if gUnmirroredFeatureSet_d
                /*make sure you can't request a full backup for unmirrored data sets*/
                tableEntryIdx = NvGetTableEntryIndexFromId(tblIdx.entryId);

                assert(gNvInvalidTableEntryIndex_c != tableEntryIdx);

                if (gNVM_MirroredInRam_c != (NVM_DataEntryType_t)pNVM_DataTable[tableEntryIdx].DataEntryType)
                {
                    tblIdx.op_type = OP_SAVE_SINGLE;
                }

#endif

/* Do Nv Restore Data */
#if (((defined(gFsciIncluded_c)) && (gFsciIncluded_c > 0U)) && \
     ((defined(gNvmEnableFSCIMonitoring_c)) && (gNvmEnableFSCIMonitoring_c > 0U)))
                {
                    FSCI_MsgNVRestoreMonitoring(tblIdx.entryId, TRUE, (uint8_t)gNVM_OK_c);
                    nvmStatus = NvRestoreData(&tblIdx);
                    FSCI_MsgNVRestoreMonitoring(tblIdx.entryId, FALSE, (uint8_t)nvmStatus);
                }
#else
                nvmStatus      = NvRestoreData(&tblIdx);
#endif
            }
        }
    }
    return nvmStatus;
}

