benjaminkravets/KW45B41Z/kw45b41zevk_eatt_central_bm/framework/NVM/source/NV_Flash.c
/******************************************************************************
 * Name: __NvSaveOnIdle
 * Description: Save the data pointed by ptrData on the next call to NvIdle()
 * Parameter(s): [IN] ptrData - pointer to data to be saved
 *               [IN] saveAll - specify if all the elements from the NVM table
 *                              entry shall be saved
 * Return: gNVM_OK_c - if operation completed successfully
 *         gNVM_Error_c - in case of error(s)
 *         Note: see also return codes of NvGetEntryFromDataPtr() function
 ******************************************************************************/
NVM_STATIC NVM_Status_t __NvSaveOnIdle(void *ptrData, bool_t saveAll)
{
    NVM_Status_t         status;
    NVM_TableEntryInfo_t tblIdx;

    if (!mNvModuleInitialized)
    {
        status = gNVM_ModuleNotInitialized_c;
    }
    else
    {
        if (NULL == ptrData)
        {
            status = gNVM_NullPointer_c;
        }
        else
        {
            /* get the NVM table entry */
            status = NvGetTableEntryIndexFromDataPtr(ptrData, &tblIdx, NULL);
            if (status == gNVM_OK_c)
            {
/* write the save all flag */
#if gNvFragmentation_Enabled_d
                tblIdx.op_type = saveAll ? OP_SAVE_ALL : OP_SAVE_SINGLE;
#else
                tblIdx.op_type = OP_SAVE_ALL;
#endif /* gNvFragmentation_Enabled_d */

                status = NvAddSaveRequestToQueue(&tblIdx);
            }
        }
    }
    return status;
}

/******************************************************************************
 * Name: __NvModulePostInit
 * Description: Do post Initialize the NV storage module when format failure
 * Parameter(s):
 * Return: gNVM_ModuleAlreadyInitialized_c - if the module is already
 *                                           initialized
 *         gNVM_InvalidSectorsCount_c - if the sector count configured in the
 *                                      project linker file is invalid
 *         gNVM_MetaNotFound_c - if no meta information was found
 *         gNVM_OK_c - module was successfully initialized
 *****************************************************************************/
NVM_STATIC NVM_Status_t __NvModulePostInit(void)
{
    NVM_Status_t status = gNVM_OK_c;
    uint32_t     pageFreeSpace;
    /* get the last meta information address */
    status = NvUpdateLastMetaInfoAddress();
    if (gNVM_OK_c == status)
    {
        /* NVM module is now initialized */
        mNvModuleInitialized = TRUE;

        /* get active page free space */
        status = NvGetPageFreeSpace(&pageFreeSpace);
        if (gNVM_OK_c == status)
        {
            if (pageFreeSpace < gNvMinimumFreeBytesCountStart_c)
            {
#if (((defined(gFsciIncluded_c)) && (gFsciIncluded_c > 0U)) && \
     ((defined(gNvmEnableFSCIMonitoring_c)) && (gNvmEnableFSCIMonitoring_c > 0U)))
                FSCI_MsgNVVirtualPageMonitoring(TRUE, gNVM_OK_c);
                status = NvCopyPage(gNvCopyAll_c);
                FSCI_MsgNVVirtualPageMonitoring(FALSE, status);
#else
                status         = NvCopyPage(gNvCopyAll_c);
#endif
            }
#if gUnmirroredFeatureSet_d
            __NvmRestoreUnmirrored();
#endif
        }
        else
        {
            /* format the system */
            status = NvInternalFormat(0);
        }
    }
    return status;
}

void NvModuleDeInit(void)
{
    mNvPageCounter          = ~0UL;
    mNVM_DataTableNbEntries = 0u;
    FLib_MemSet(&mNvVirtualPageProperty[0], 0u,
                gNvVirtualPagesCount_c * sizeof(NVM_VirtualPageProperties_t)); /*! virtual page properties */

    mNvCopyOperationIsPending = FALSE;

    mNvErasePgCmdStatus.NvErasePending  = FALSE;
    mNvErasePgCmdStatus.NvPageToErase   = gVirtualPageNone_c;
    mNvErasePgCmdStatus.NvSectorAddress = 0u;

    mNvFlashConfigInitialised = FALSE;

#if gNvFragmentation_Enabled_d
    FLib_MemSet(&maNvRecordsCpyOffsets[0], 0u, gNvRecordsCopiedBufferSize_c * sizeof(maNvRecordsCpyOffsets[0]));
#endif

#if gNvUseExtendedFeatureSet_d
    mNvTableSizeInFlash  = 0u;
    mNvTableMarker       = 0u;
    mNvFlashTableVersion = 0u;
    mNvTableUpdated      = FALSE;
#endif /* gNvUseExtendedFeatureSet_d */

    mNvModuleInitialized        = FALSE;
    mNvCriticalSectionFlag      = 0u;
    mNvMinimumTicksBetweenSaves = gNvMinimumTicksBetweenSaves_c;
    mNvCountsBetweenSaves       = gNvCountsBetweenSaves_c;

    FLib_MemSet(&mNvPendingSavesQueue, 0u, sizeof(maNvRecordsCpyOffsets[0]));

    FLib_MemSet(&maDatasetInfo[0], 0u, gNvTableEntriesCountMax_c * sizeof(NVM_DatasetInfo_t));

    mNvSaveOnIntervalEvent = FALSE; /*! flag used to signal an 'SaveOnInterval' event */

    mNvLastTimestampValue = 0uL;

    mNvActivePageId = gVirtualPageNone_c;

#if gNvUseExtendedFeatureSet_d
    mNvTableMarker       = gNvTableMarker_c;
    mNvFlashTableVersion = gNvFlashTableVersion_c;
    mNvTableUpdated      = FALSE;
#endif /* gNvUseExtendedFeatureSet_d */

    mNvModuleInitialized = FALSE;
}

/******************************************************************************
 * Name: __NvModuleInit
 * Description: Initialize the NV storage module
 * Parameter(s): [IN] flashInit - need to Initialize flash adapter
 * Return: gNVM_ModuleAlreadyInitialized_c - if the module is already
 *                                           initialized
 *         gNVM_InvalidSectorsCount_c - if the sector count configured in the
 *                                      project linker file is invalid
 *         gNVM_MetaNotFound_c - if no meta information was found
 *         gNVM_OK_c - module was successfully initialized
 *****************************************************************************/
#if defined(__IAR_SYSTEMS_ICC__)
#pragma required = eraseNVMFirst
#pragma required = eraseNVMSecond
#endif /* __IAR_SYSTEMS_ICC__ */
NVM_STATIC NVM_Status_t __NvModuleInit(bool_t flashInit)
{
    uint16_t     loopCnt;
    NVM_Status_t status            = gNVM_OK_c;
    uint32_t     flashEstimateSize = 0U;
    uint32_t     pageFreeSpace     = 0;

    if (mNVM_DataTableNbEntries == 0u)
    {
        /* If deinit was applied need to reset to normal value deduced from NVM_TABLE section size.
           Might be made to pint explicitly on an alternate dataset so test if initialized.
        */
        mNVM_DataTableNbEntries = gNVM_TABLE_entries_c;
    }
#if gNvUseExtendedFeatureSet_d
    bool_t ret = FALSE;
#endif
#if defined(__IAR_SYSTEMS_ICC__)
    (void)eraseNVMFirst;
    (void)eraseNVMSecond;
#endif
    if ((mNVM_DataTableNbEntries == 0U) || (mNVM_DataTableNbEntries >= gNvTableEntriesCountMax_c))
    {
        status = gNVM_InvalidTableEntriesCount_c;
    }
    else
    {
#if (gNvFragmentation_Enabled_d == TRUE)
        for (loopCnt = 0; loopCnt < mNVM_DataTableNbEntries; loopCnt++)
        {
            if (pNVM_DataTable[loopCnt].ElementsCount > (uint32_t)gNvRecordsCopiedBufferSize_c)
            {
                status = gNVM_DefragBufferTooSmall_c;
                break;
            }
        }
        if (gNVM_OK_c == status)
#endif
        {
            /* Initialize the pending saves queue */
            NvInitPendingSavesQueue(&mNvPendingSavesQueue);

            /* Initialize the data set info table */
            for (loopCnt = 0; loopCnt < (uint16_t)gNvTableEntriesCountMax_c; loopCnt++)
            {
                maDatasetInfo[loopCnt].saveNextInterval = FALSE;
                maDatasetInfo[loopCnt].countsToNextSave = mNvCountsBetweenSaves;
            }

