benjaminkravets/KW45B41Z/kw45b41zevk_eatt_central_bm/framework/NVM/source/NV_Flash.c
            /* initialize the event used by save-on-interval functionality */
            mNvSaveOnIntervalEvent = FALSE;

            /* check linker file symbol definition for sector count; it should be multiple of 2 */
            if ((((uint32_t)NV_STORAGE_MAX_SECTORS) & 0x1u) != 0u)
            {
                status = gNVM_InvalidSectorsCount_c;
            }
            else
            {
                /* Init the NVM configuration */
                InitNVMConfig();

                /* both pages are not valid, format the NV storage system */
                if (mNvActivePageId == gVirtualPageNone_c)
                {
                    mNvActivePageId = gFirstVirtualPage_c;
#if gNvDualImageSupport
                    (void)NvGetEntryInfoNeedToAddInNVM();
#endif /* gNvDualImageSupport */
                    status = NvInternalFormat(0);
                    (void)NvGetPageFreeSpace(&pageFreeSpace);
                    for (loopCnt = 0; loopCnt < mNVM_DataTableNbEntries; loopCnt++)
                    {
                        flashEstimateSize +=
                            (NvUpdateSize(pNVM_DataTable[loopCnt].ElementSize) + sizeof(NVM_RecordMetaInfo_t)) *
                            pNVM_DataTable[loopCnt].ElementsCount;
                    }
                    if (pageFreeSpace < (flashEstimateSize + gNvMinimumFreeBytesCountStart_c))
                    {
                        assert(0);
                        /* Estimated Flash buffer is too small, Need increase the gNVMSectorCountLink_d */
                        status = gNVM_ReservedFlashTooSmall_c;
                    }
                }
                if (gNVM_OK_c == status)
                {
#if gNvUseExtendedFeatureSet_d
                    /* get the size of the NV table stored in FLASH memory */
                    mNvTableSizeInFlash = NvGetFlashTableSize();

                    if (0u == mNvTableSizeInFlash) /* no NV table found in FLASH, format the system */
                    {
#if gNvDualImageSupport
                        NvGetEntryInfoNeedToAddInNVM();
#endif                                                /* gNvDualImageSupport */
                        status = NvInternalFormat(0); /* will also save the NV table to FLASH memory */
                        if (status != gNVM_OK_c)
                        {
                            ret = TRUE;
                        }
                    }
                    else /* found an valid NV table in FLASH memory */
                    {
                        /* check if the RAM table was updated (e.g. new binary image via OTA) */
                        mNvTableUpdated = (GetFlashTableVersion() != mNvFlashTableVersion) || NvIsRamTableUpdated();
#if gNvDualImageSupport
                        if (NvGetEntryInfoNeedToAddInNVM() != 0)
                        {
                            mNvTableUpdated = TRUE;
                        }
#endif /* gNvDualImageSupport */
                        if (mNvTableUpdated)
                        {
                            ret = TRUE;
                            if (gNVM_OK_c == NvUpdateLastMetaInfoAddress())
                            {
/* copy the new RAM table and the page content */
#if (((defined(gFsciIncluded_c)) && (gFsciIncluded_c > 0U)) && \
     ((defined(gNvmEnableFSCIMonitoring_c)) && (gNvmEnableFSCIMonitoring_c > 0U)))
                                FSCI_MsgNVVirtualPageMonitoring(TRUE, gNVM_OK_c);
                                status = NvCopyPage(gNvCopyAll_c);
                                FSCI_MsgNVVirtualPageMonitoring(FALSE, status);
#else
                                status = NvCopyPage(gNvCopyAll_c);
#endif

                                /* NVM module is now initialised */
                                mNvModuleInitialized = TRUE;
                                mNvTableUpdated      = FALSE;

#if gUnmirroredFeatureSet_d
                                __NvmRestoreUnmirrored();
#endif
                            }
                            else
                            {
                                /* format the system */
                                status = NvInternalFormat(0);
                            }
                        }
                    }
                    if (FALSE == ret)
#endif /* gNvUseExtendedFeatureSet_d */
                    {
                        status = __NvModulePostInit();
                    }
                }
            }
        }
    }
    return status;
}

/******************************************************************************
 * Name: NvModuleReInit
 * Description: Reinit the NV module , reload from Flash to RAM the latest NVM changes
 *      Useful for RAM off use case in lowpower
 *    Same as __NvModuleInit without call to NV_Init(); and no mNvModuleInitialized protection
 *  TODO : merge with __NvModuleInit some common processing
 *****************************************************************************/
NVM_Status_t NvModuleReInit(void)
{
    return __NvModuleInit(FALSE);
}

#if gUnmirroredFeatureSet_d

/******************************************************************************
 * Name: NvIsRecordErased
 * Description: Checks the most recent metas to see if the unmirrored element
 *              was erased or is just uninitialised
 * Parameter(s): [IN] srcTableEntryIdx - the index of the entry to be checked
 *               [IN] srcTableEntryElementIdx - the element index
 *               [IN] srcMetaAddress - the starting address of the search
 * Return: TRUE if the element was erased with NvErase or FALSE otherwise
 *****************************************************************************/
NVM_STATIC bool_t NvIsRecordErased(uint16_t srcTableEntryIdx, uint16_t srcTableEntryElementIdx, uint32_t srcMetaAddress)
{
    bool_t               status      = FALSE;
    NVM_RecordMetaInfo_t srcMetaInfo = {0};
    while (srcMetaAddress < (mNvVirtualPageProperty[mNvActivePageId].NvRawSectorEndAddress))
    {
        (void)NvGetMetaInfo(mNvActivePageId, srcMetaAddress, &srcMetaInfo);
        if (gNvGuardValue_c == srcMetaInfo.rawValue)
        {
            break;
        }
        if ((srcMetaInfo.fields.NvmRecordOffset == 0u) &&
            (srcMetaInfo.fields.NvmElementIndex == srcTableEntryElementIdx) &&
            (srcMetaInfo.fields.NvmDataEntryID == pNVM_DataTable[srcTableEntryIdx].DataEntryID))
        {
            status = TRUE;
            break;
        }
        srcMetaAddress += sizeof(NVM_RecordMetaInfo_t);
    }
    return status;
}

