benjaminkravets/KW45B41Z/kw45b41zevk_eatt_central_bm/framework/NVM/source/NV_Flash.c
/******************************************************************************
 * Name: __NvmErase
 * Description: Erase from NVM an unmirrored dataset
 * Parameter(s):  ppData     double pointer to the entity to be erased
 * Return: pointer to Ram location
 *****************************************************************************/
NVM_STATIC NVM_Status_t __NvmErase(void **ppData)
{
    NVM_Status_t         status;
    NVM_TableEntryInfo_t tblIdx;
    uint16_t             tableEntryIndex;
    uint16_t             loopCnt;
    uint16_t             remaining_count;

    /* Get entry from NVM table */
    status = NvGetTableEntryIndexFromDataPtr(ppData, &tblIdx, &tableEntryIndex);
    if (gNVM_OK_c == status)
    {
        if (gNVM_MirroredInRam_c == (NVM_DataEntryType_t)pNVM_DataTable[tableEntryIndex].DataEntryType)
        {
            status = gNVM_IsMirroredDataSet_c;
        }
        else
        {
            if (!NvIsNVMFlashAddress(*ppData))
            {
                if (*ppData != NULL)
                {
                    (void)MEM_BufferFree(*ppData);
                }
                OSA_InterruptDisable();
                *ppData = NULL;
                OSA_InterruptEnable();
                status = gNVM_OK_c;
            }
            else
            {
                /* Check if is in pending queue - if yes than remove it */
                if (NvIsPendingOperation())
                {
                    /* Start from the queue's head */
                    loopCnt         = mNvPendingSavesQueue.Head;
                    remaining_count = mNvPendingSavesQueue.EntriesCount;
                    while (remaining_count != 0u)
                    {
                        /* if the element is waiting to be saved, cancel the save */
                        if ((tblIdx.entryId == mNvPendingSavesQueue.QData[loopCnt].entryId) &&
                            (tblIdx.elementIndex == mNvPendingSavesQueue.QData[loopCnt].elementIndex))
                        {
                            mNvPendingSavesQueue.QData[loopCnt].entryId = gNvInvalidDataEntry_c;
                        }
                        remaining_count--;
                        /* increment and wrap the loop index */
                        if (++loopCnt >= (uint8_t)gNvPendingSavesQueueSize_c)
                        {
                            loopCnt = 0;
                        }
                    }
                }
                OSA_InterruptDisable();
                *ppData = NULL;
                OSA_InterruptEnable();
                status = __NvSyncSave(ppData, FALSE);
            }
        }
    }
    return status;
}

/******************************************************************************
 * Name: NvIsNVMFlashAddress
 * Description: check if the address is in Flash
 * Parameter(s): [IN] address
 *
 * Return: TRUE if the table entry is in Flash / FALSE otherwise
 ******************************************************************************/
NVM_STATIC bool_t NvIsNVMFlashAddress(void *address)
{
    bool_t  status = FALSE;
    uint8_t idx;
    for (idx = 0; idx < gNvVirtualPagesCount_c; idx++)
    {
        if (((uint32_t)((uint32_t *)address) > mNvVirtualPageProperty[idx].NvRawSectorStartAddress) &&
            ((uint32_t)((uint32_t *)address) < mNvVirtualPageProperty[idx].NvRawSectorEndAddress))
        {
            status = TRUE;
            break;
        }
    }
    return status;
}
#endif

/******************************************************************************
 * Name: NvInitPendingSavesQueue
 * Description: Initialize the pending saves queue
 * Parameters: [IN] pQueue - pointer to queue
 * Return: none
 ******************************************************************************/
NVM_STATIC void NvInitPendingSavesQueue(NVM_SaveQueue_t *pQueue)
{
    assert(NULL != pQueue);
    pQueue->Head         = 0;
    pQueue->Tail         = 0;
    pQueue->EntriesCount = 0;
}

/******************************************************************************
 * Name: NvPushPendingSave
 * Description: Add a new pending save to the queue
 * Parameters: [IN] pQueue - pointer to queue
 *             [IN] data - data to be saved
 * Return: TRUE if the push operation succeeded, FALSE otherwise
 ******************************************************************************/
NVM_STATIC bool_t NvPushPendingSave(NVM_SaveQueue_t *pQueue, NVM_TableEntryInfo_t data)
{
    bool_t status = FALSE;

    assert(NULL != pQueue); /* this is an internal function always called with non NULL queue pointer */

    /* Can only add to queue if at least one slot is remaining */
    if (pQueue->EntriesCount < (uint16_t)(gNvPendingSavesQueueSize_c))
    {
        /* Add the item to queue */
        pQueue->QData[pQueue->Tail] = data;
        /* Increment and wrap the tail when it reaches gNvPendingSavesQueueSize_c */
        INCREMENT_Q_INDEX(pQueue->Tail);

        /* Increment the entries count */
        pQueue->EntriesCount++;

        status = TRUE;
    }

    return status;
}

/******************************************************************************
 * Name: NvGetPendingSaveHead
 * Description: Retrieves the head element from the pending saves queue
 * Parameters: [IN] pQueue - pointer to queue
 *             [OUT] pData - pointer to the location where data will be placed
 * Return: TRUE if the pop operation succeeded, FALSE otherwise
 ******************************************************************************/
NVM_STATIC bool_t NvGetPendingSaveHead(NVM_SaveQueue_t *pQueue, NVM_TableEntryInfo_t *pData)
{
    bool_t status = FALSE;
    assert(pQueue != NULL);
    assert(pData != NULL);
    if (pQueue->EntriesCount != 0u)
    {
        *pData = pQueue->QData[pQueue->Head];
        status = TRUE;
    }
    return status;
}

NVM_STATIC void NvRemovePendingSaveHead(NVM_SaveQueue_t *pQueue)
{
    /* Increment and wrap the head when it reaches gNvPendingSavesQueueSize_c */
    INCREMENT_Q_INDEX(pQueue->Head);

    /* Decrement the entries count */
    pQueue->EntriesCount--;
}

