benjaminkravets/KW45B41Z/kw45b41zevk_eatt_central_bm/framework/NVM/source/NV_Flash.c
    if (paddingBytes != 0u)
    {
        size += (uint8_t)((uint8_t)PGM_SIZE_BYTE - paddingBytes);
    }

    return size;
}

/******************************************************************************
 * Name: NvEraseVirtualPage
 * Description: erase the specified page
 * Parameter(s): [IN] pageID - the ID of the page to be erased
 * Return: gNVM_InvalidPageID_c - if the page ID is not valid
 *         gNVM_SectorEraseFail_c - if the page cannot be erased
 *         gNVM_OK_c - if operation completed successfully
 *****************************************************************************/
NVM_STATIC NVM_Status_t NvEraseVirtualPage(NVM_VirtualPageID_t pageID)
{
    NVM_Status_t status = gNVM_OK_c;

    if (pageID > gSecondVirtualPage_c)
    {
        status = gNVM_InvalidPageID_c;
    }
    else
    {
        /* erase virtual page */
        status = (NVM_Status_t)HAL_FlashEraseSector(mNvVirtualPageProperty[pageID].NvRawSectorStartAddress,
                                                    mNvVirtualPageProperty[pageID].NvTotalPageSize);
        if (kStatus_HAL_Flash_Success != (hal_flash_status_t)status)
        {
            status = gNVM_SectorEraseFail_c;
        }
        else
        {
            status = NvVirtualPageBlankCheck(pageID);
        }
#if (((defined(gFsciIncluded_c)) && (gFsciIncluded_c > 0U)) && \
     ((defined(gNvmEnableFSCIMonitoring_c)) && (gNvmEnableFSCIMonitoring_c > 0U)))
        FSCI_MsgNVPageEraseMonitoring(mNvVirtualPageProperty[pageID].NvRawSectorStartAddress, status);
#endif
    }
    return status;
}
/******************************************************************************
 * Name: NvSetErasePgCmdStatus
 * Description: Nv Set Erase Page CmdStatus
 * Parameter(s): [IN] PageToErase - the ID of the page to be erased
 * Parameter(s): [IN] read_legacy_location - need use legacy locaton
 * Parameter(s): [IN] doPageBlankCheck - need do page blank check
 * Parameter(s): -
 * Return: -
 *****************************************************************************/
NVM_STATIC void NvSetErasePgCmdStatus(NVM_VirtualPageID_t PageToErase,
                                      bool_t              read_legacy_location,
                                      bool_t              doPageBlankCheck)
{
    mNvActivePageId = (PageToErase == gSecondVirtualPage_c) ? gFirstVirtualPage_c : gSecondVirtualPage_c;

    if (read_legacy_location)
    {
        /* check need do BlankCheck */
        if (((gNVM_PageIsNotBlank_c == NvVirtualPageBlankCheck(PageToErase)) && doPageBlankCheck) ||
            (!doPageBlankCheck))
        {
            /* request the erase of the  page */
            mNvErasePgCmdStatus.NvPageToErase   = PageToErase;
            mNvErasePgCmdStatus.NvSectorAddress = mNvVirtualPageProperty[PageToErase].NvRawSectorStartAddress;
            mNvErasePgCmdStatus.NvErasePending  = TRUE;
        }
    }
}

NVM_STATIC void NvPostFwUpdateMaintenance(void)
{
    NVM_VirtualPageID_t pageID;
    uint32_t            sect_sz = (uint32_t)((uint8_t *)NV_STORAGE_SECTOR_SIZE);
    uint32_t            cpt;

    for (cpt = (uint32_t)gFirstVirtualPage_c; cpt <= (uint32_t)gSecondVirtualPage_c; cpt++)
    {
        pageID                                  = (NVM_VirtualPageID_t)cpt;
        NVM_VirtualPageProperties_t *page_props = &mNvVirtualPageProperty[pageID];
        uint32_t                     p          = page_props->NvRawSectorStartAddress;

        if (*(uint32_t *)p == 0xffffffffU)
        {
            /* we read 0xffffffffU from the flash: it either means that it is blank / erased or written with 0xffffffff
             * . HAL_FlashVerifyErase does not make the difference!
             */
            for (uint8_t i = 0; i < page_props->NvRawSectorsCount; i++)
            {
                /* Check if sector requires an erase */
                if (HAL_FlashVerifyErase(p, sect_sz, kHAL_Flash_MarginValueNormal) != kStatus_HAL_Flash_Success)
                {
                    (void)HAL_FlashEraseSector(p, sect_sz);
                }
                p += sect_sz;
            }
        }
    }
}

/******************************************************************************
 * Name: NvInitStorageSystem
 * Description: Initialize the storage system, retrieve the active page and
 *              the page counter. Called once by NvModuleInit() function.
 * Parameter(s): -
 * Return: -
 *****************************************************************************/
NVM_STATIC void NvInitStorageSystem(bool_t read_legacy_location)
{
    uint32_t value;
    uint32_t firstPageCounterTopValue;
    uint32_t firstPageCounterBottomValue;
    uint32_t secondPageCounterTopValue;
    uint32_t secondPageCounterBottomValue;
    uint8_t  location_offset = (read_legacy_location ? gNvLegacyOffset_c : 0u);

    NvPostFwUpdateMaintenance();

    /* read both pages counter values */
    NV_FlashRead((uint8_t *)mNvVirtualPageProperty[gFirstVirtualPage_c].NvRawSectorStartAddress, (uint8_t *)&value,
                 sizeof(value));
    firstPageCounterTopValue = value;
    NV_FlashRead((uint8_t *)mNvVirtualPageProperty[gFirstVirtualPage_c].NvRawSectorEndAddress -
                     sizeof(NVM_TableInfo_t) + 1u + location_offset,
                 (uint8_t *)&value, sizeof(value));
    firstPageCounterBottomValue = value;

    NV_FlashRead((uint8_t *)mNvVirtualPageProperty[gSecondVirtualPage_c].NvRawSectorStartAddress, (uint8_t *)&value,
                 sizeof(value));
    secondPageCounterTopValue = value;
    NV_FlashRead((uint8_t *)mNvVirtualPageProperty[gSecondVirtualPage_c].NvRawSectorEndAddress -
                     sizeof(NVM_TableInfo_t) + 1u + location_offset,
                 (uint8_t *)&value, sizeof(value));
    secondPageCounterBottomValue = value;

    /* get the active page */
    if ((firstPageCounterTopValue == firstPageCounterBottomValue) &&
        (gPageCounterMaxValue_c != firstPageCounterTopValue)) /* first page is valid */
    {
        if ((secondPageCounterTopValue == secondPageCounterBottomValue) &&
            (gPageCounterMaxValue_c != secondPageCounterTopValue)) /* second page is valid */
        {
            if (firstPageCounterTopValue >= secondPageCounterTopValue)
            {
                /* first page is active */
                mNvPageCounter  = firstPageCounterTopValue;
                mNvActivePageId = gFirstVirtualPage_c;
            }
            else
            {
                /* second page is active */
                mNvPageCounter  = secondPageCounterTopValue;
                mNvActivePageId = gSecondVirtualPage_c;
            }
        }
        else
        {
            if (secondPageCounterTopValue != secondPageCounterBottomValue)
            {
                /* first page is active */
                mNvPageCounter = firstPageCounterTopValue;
                NvSetErasePgCmdStatus(gSecondVirtualPage_c, read_legacy_location, FALSE);
            }
            else
            {
                /* first page is active */
                mNvPageCounter = firstPageCounterTopValue;
                NvSetErasePgCmdStatus(gSecondVirtualPage_c, read_legacy_location, TRUE);
            }
        }
    }
    else
    {
        if (firstPageCounterTopValue != firstPageCounterBottomValue) /* first page is not valid */
        {
            if ((secondPageCounterTopValue == secondPageCounterBottomValue) &&
                (gPageCounterMaxValue_c != secondPageCounterTopValue)) /* second page is valid */
            {
                /* second page is active */
                mNvPageCounter = secondPageCounterTopValue;
                NvSetErasePgCmdStatus(gFirstVirtualPage_c, read_legacy_location, FALSE);
            }
            else
            {
                mNvActivePageId = gVirtualPageNone_c;
            }
        }
        else
        {
            if ((secondPageCounterTopValue == secondPageCounterBottomValue) &&
                (gPageCounterMaxValue_c != secondPageCounterTopValue)) /* second page is valid */
            {
                /* second page is active */
                mNvPageCounter = secondPageCounterTopValue;
                NvSetErasePgCmdStatus(gFirstVirtualPage_c, read_legacy_location, TRUE);
            }
            else
            {
                mNvActivePageId = gVirtualPageNone_c;
            }
        }
    }
}

