benjaminkravets/KW45B41Z/kw45b41zevk_eatt_central_bm/framework/NVM/source/NV_Flash.c
/******************************************************************************
 * Name: NvGetPageFreeSpace
 * Description: return the page free space, in bytes
 * Parameter(s): [OUT] ptrFreeSpace - a pointer to a memory location where the
 *                                    page free space will be stored
 * Return: gNVM_InvalidPageID_c - if the active page is not valid
 *         gNVM_NullPointer_c - if the provided pointer is NULL
 *         gNVM_PageIsEmpty_c - if the page is empty
 *         gNVM_OK_c - if the operation completed successfully
 *****************************************************************************/
NVM_STATIC NVM_Status_t NvGetPageFreeSpace(uint32_t *ptrFreeSpace)
{
    NVM_RecordMetaInfo_t metaInfo;
    NVM_Status_t         retVal;
#if gUnmirroredFeatureSet_d
    NVM_RecordMetaInfo_t metaInfoUndeleted;
    bool_t               ret = FALSE;
#endif

    if (gEmptyPageMetaAddress_c == mNvVirtualPageProperty[mNvActivePageId].NvLastMetaInfoAddress)
    {
#if gNvUseExtendedFeatureSet_d
        *ptrFreeSpace = mNvVirtualPageProperty[mNvActivePageId].NvTotalPageSize - mNvTableSizeInFlash -
                        3u * sizeof(NVM_TableInfo_t);
#else
        *ptrFreeSpace = mNvVirtualPageProperty[mNvActivePageId].NvTotalPageSize - 2u * sizeof(NVM_TableInfo_t);
#endif /* gNvUseExtendedFeatureSet_d */
        retVal = gNVM_OK_c;
    }
    else
    {
        retVal =
            NvGetMetaInfo(mNvActivePageId, mNvVirtualPageProperty[mNvActivePageId].NvLastMetaInfoAddress, &metaInfo);

        if (gNVM_OK_c == retVal)
        {
#if gUnmirroredFeatureSet_d
            {
                if (metaInfo.fields.NvmRecordOffset == 0u)
                {
                    retVal = NvGetMetaInfo(mNvActivePageId,
                                           mNvVirtualPageProperty[mNvActivePageId].NvLastMetaUnerasedInfoAddress,
                                           &metaInfoUndeleted);
                    if (gNVM_OK_c != retVal)
                    {
                        *ptrFreeSpace = 0;
                        ret           = TRUE;
                    }
                    else
                    {
                        metaInfo.fields.NvmRecordOffset = metaInfoUndeleted.fields.NvmRecordOffset;
                    }
                }
            }
            if (FALSE == ret)
#endif
            {
                *ptrFreeSpace =
                    (mNvVirtualPageProperty[mNvActivePageId].NvRawSectorStartAddress +
                     metaInfo.fields.NvmRecordOffset) -
                    (mNvVirtualPageProperty[mNvActivePageId].NvLastMetaInfoAddress + sizeof(NVM_RecordMetaInfo_t));
            }
        }
        else
        {
            *ptrFreeSpace = 0;
        }
    }
    return retVal;
}

/******************************************************************************
 * Name: NvIsMemoryAreaAvailable
 * Description: checks if the specified memory area is blank (erased)
 * Parameter(s): [IN] address - start address
 *               [IN] len - length to be verified
 * Return: TRUE if the area is available (blank), FALSE otherwise
 *****************************************************************************/
NVM_STATIC bool_t NvIsMemoryAreaAvailable(uint32_t address, uint32_t len)
{
    bool_t status = TRUE;

    if (len % (uint8_t)PGM_SIZE_BYTE != 0u)
    {
        status = FALSE;
    }
    else
    {
        if (address < mNvVirtualPageProperty[mNvActivePageId].NvRawSectorStartAddress ||
            address > mNvVirtualPageProperty[mNvActivePageId].NvRawSectorEndAddress)
        {
            status = FALSE;
        }
        else
        {
            if ((address + len) > mNvVirtualPageProperty[mNvActivePageId].NvRawSectorEndAddress + 1U)
            {
                status = FALSE;
            }
            else
            {
                /* blank check */
                if (kStatus_HAL_Flash_Success != HAL_FlashVerifyErase(address, len, kHAL_Flash_MarginValueNormal))
                {
                    status = FALSE;
                }
            }
        }
    }
    return status;
}

/******************************************************************************
 * Name: NvIsRecordCopied
 * Description: Checks if a record or an entire table entry is already copied.
 *              Called by page copy function.
 * Parameter(s): [IN] pageId - the ID of the page where to perform the check
 *               [IN] metaInf - a pointer to source page meta information tag
 * Return: TRUE if the element is already copied, FALSE otherwise
 *****************************************************************************/
NVM_STATIC bool_t NvIsRecordCopied(NVM_VirtualPageID_t pageId, NVM_RecordMetaInfo_t *metaInf)
{
    uint32_t             loopAddress;
    NVM_RecordMetaInfo_t metaValue;
    bool_t               retVal;

    loopAddress = mNvVirtualPageProperty[pageId].NvRawSectorStartAddress + gNvFirstMetaOffset_c;
#if gNvDualImageSupport
    loopAddress += sizeof(NVM_TableInfo_t) * gNeedAddEntryCnt;
#endif

    retVal = FALSE;

    do
    {
        /* read the meta information tag */
        NV_FlashRead((uint8_t *)loopAddress, (uint8_t *)&metaValue, sizeof(NVM_RecordMetaInfo_t));

        if (gNvGuardValue_c == metaValue.rawValue)
        {
            /* reached last meta */
            break;
        }

        if (metaValue.fields.NvValidationStartByte != metaValue.fields.NvValidationEndByte)
        {
            /* invalid meta */
            loopAddress += sizeof(NVM_RecordMetaInfo_t);
            continue;
        }

        if (metaInf->fields.NvmDataEntryID == metaValue.fields.NvmDataEntryID)
        {
            if (metaInf->fields.NvValidationStartByte == gValidationByteSingleRecord_c)
            {
                if (metaValue.fields.NvValidationStartByte == gValidationByteSingleRecord_c)
                {
                    if (metaValue.fields.NvmElementIndex == metaInf->fields.NvmElementIndex)
                    {
                        retVal = TRUE;
                        break;
                    }

                    /* skip */
                    loopAddress += sizeof(NVM_RecordMetaInfo_t);
                    continue;
                }
                retVal = TRUE;
                break;
            }

