benjaminkravets/KW45B41Z/kw45b41zevk_eatt_central_bm/framework/NVM/source/NV_Flash.c
            if (metaInf->fields.NvValidationStartByte == gValidationByteAllRecords_c)
            {
                if (metaValue.fields.NvValidationStartByte == gValidationByteSingleRecord_c)
                {
                    /* skip */
                    loopAddress += sizeof(NVM_RecordMetaInfo_t);
                    continue;
                }
                retVal = TRUE;
                break;
            }

            /* skip */
            loopAddress += sizeof(NVM_RecordMetaInfo_t);
            continue;
        }

        loopAddress += sizeof(NVM_RecordMetaInfo_t);

    } while (loopAddress < mNvVirtualPageProperty[pageId].NvRawSectorEndAddress);

    return retVal;
}

/******************************************************************************
 * Name: NvInternalCopy
 * Description: Performs a copy of an record / entire table entry
 * Parameter(s): [IN] dstAddress - destination record address
 *               [IN] dstMetaAddress - destination meta address
 *               [IN] srcMetaInfo - source meta information
 *               [IN] srcTblEntryIdx - source table entry index
 *               [IN] size - bytes to copy
 * Return: gNVM_InvalidPageID_c - if the source or destination page is not
 *                                valid
 *         gNVM_MetaInfoWriteError_c - if the meta information couldn't be
 *                                     written
 *         gNVM_RecordWriteError_c - if the record couldn't be written
 *         gNVM_Error_c - in case of error(s)
 *         gNVM_OK_c - page copy completed successfully
 *****************************************************************************/
NVM_STATIC NVM_Status_t NvInternalCopy(uint32_t              dstAddress,
                                       uint32_t              dstMetaAddress,
                                       NVM_RecordMetaInfo_t *srcMetaInfo,
                                       uint16_t              srcTblEntryIdx,
                                       uint16_t              size)
{
    uint16_t             innerOffset;
    uint8_t              cacheBuffer[gNvCacheBufferSize_c] = {0U};
    NVM_RecordMetaInfo_t dstMetaInfo;
    uint16_t             diffSize = 0;
    uint16_t             diffIdx  = 0;
    uint16_t             ramSize  = 0;
    uint8_t              misalignedBytes;
    uint16_t             loopIdx;
    uint16_t             loopEnd;
    NVM_Status_t         status = gNVM_OK_c;

    /* Initialize the inner offset*/
    innerOffset = 0;

    /* prepare destination page meta info tag and write if after the record is entirely written.
     * the preparation is made here because the 'dstAddress' may change afterwards
     */
    dstMetaInfo.fields                 = srcMetaInfo->fields;
    dstMetaInfo.fields.NvmRecordOffset = (uint16_t)(
        (uint32_t)(dstAddress - mNvVirtualPageProperty[((uint8_t)mNvActivePageId + 1U) % 2U].NvRawSectorStartAddress));

    if (srcMetaInfo->fields.NvValidationStartByte != gValidationByteSingleRecord_c)
    {
#if gNvDualImageSupport
        /* if the srcTableEntryIdx is invalid for this function, it means the entry is from NVM, not from registed RAM
           then it not need to check if NvTable is changed from RAM  */
        if (srcTblEntryIdx == gNvInvalidTableEntryIndex_c)
        {
            // not action needs
        }
        else
        {
#endif /* gNvDualImageSupport */
            ramSize = pNVM_DataTable[srcTblEntryIdx].ElementsCount * pNVM_DataTable[srcTblEntryIdx].ElementSize;
            /* if the bytes to copy are less then RAM table entry space, the supplementary bytes to write on the
             * destination page will be retrieved from RAM table entry. This is the case when the RAM table has been
             * updated and the new entry's elements count is greater then the one existing in the previous RAM table,
             * now stored in the FLASH active page (source page) */
            if (size < ramSize)
            {
                diffSize = ramSize - size;
                diffIdx  = size / pNVM_DataTable[srcTblEntryIdx].ElementSize;
            }
#if gNvDualImageSupport
        }
#endif /* gNvDualImageSupport */
    }

    while (size != 0u)
    {
        if (size > (uint16_t)gNvCacheBufferSize_c)
        {
            /* copy from FLASH to cache buffer */
            NV_FlashRead((uint8_t *)mNvVirtualPageProperty[mNvActivePageId].NvRawSectorStartAddress +
                             srcMetaInfo->fields.NvmRecordOffset + innerOffset,
                         (uint8_t *)&cacheBuffer[0], (uint16_t)gNvCacheBufferSize_c);

            /* write to destination page */
            if (kStatus_HAL_Flash_Success ==
                HAL_FlashProgramUnaligned(dstAddress, (uint16_t)gNvCacheBufferSize_c, cacheBuffer))
            {
                /* update the destination record address copy */
                dstAddress += (uint16_t)gNvCacheBufferSize_c;
                /* update the record size */
                size -= (uint16_t)gNvCacheBufferSize_c;
                /* update the inner offset value */
                innerOffset += (uint16_t)gNvCacheBufferSize_c;

                continue;
            }
            status = gNVM_RecordWriteError_c;
            break;
        }
        else
        {
            /* copy from FLASH to cache buffer */
            NV_FlashRead((uint8_t *)mNvVirtualPageProperty[mNvActivePageId].NvRawSectorStartAddress +
                             srcMetaInfo->fields.NvmRecordOffset + innerOffset,
                         (uint8_t *)&cacheBuffer[0], size);
            break;
        }
    }

    if (gNVM_OK_c == status)
    {
        if (diffSize != 0u)
        {
            /* update the destination record address copy */
            dstAddress += size;

            /* check alignment and adjust it if necessary */
            misalignedBytes = (uint8_t)((dstAddress - (dstAddress & (~((uint32_t)PGM_SIZE_BYTE - 1U)))));

            /* initialise the inner offset */
            innerOffset = 0;

            /* check if the destination is longword aligned or not */
            if (misalignedBytes != 0u)
            {
                /* align to previous 32 bit boundary */
                dstAddress &= ((uint32_t) ~(uint32_t)((uint32_t)PGM_SIZE_BYTE - 1UL));

                /* compute the loop end */
                loopEnd = (uint16_t)PGM_SIZE_BYTE - misalignedBytes;

