benjaminkravets/KW45B41Z/kw45b41zevk_eatt_central_bm/framework/NVM/source/NV_Flash.c
                /* update with data from RAM */
                for (loopIdx = 0U; loopIdx < loopEnd; loopIdx++)
                {
                    cacheBuffer[misalignedBytes] =
                        *((uint8_t *)pNVM_DataTable[srcTblEntryIdx].pData +
                          (diffIdx * pNVM_DataTable[srcTblEntryIdx].ElementSize) + innerOffset);
                    innerOffset++;
                    misalignedBytes++;
                    if (innerOffset == diffSize)
                    {
                        break;
                    }
                }

                /* write to Flash destination page */
                if (kStatus_HAL_Flash_Success != HAL_FlashProgramUnaligned(dstAddress, PGM_SIZE_BYTE, cacheBuffer))
                {
                    status = gNVM_RecordWriteError_c;
                }
                else
                {
                    /* align to next 32 bit boundary */
                    dstAddress += (uint32_t)PGM_SIZE_BYTE;
                }
            }

            if (gNVM_OK_c == status)
            {
                /* write to Flash destination page the rest of the aligned data */
                if (kStatus_HAL_Flash_Success !=
                    HAL_FlashProgramUnaligned(dstAddress, (uint32_t)diffSize - (uint32_t)innerOffset,
                                              ((uint8_t *)pNVM_DataTable[srcTblEntryIdx].pData +
                                               (diffIdx * pNVM_DataTable[srcTblEntryIdx].ElementSize) + innerOffset)))
                {
                    status = gNVM_RecordWriteError_c;
                }
            }
        }
        else
        {
            /* write to destination page */
            if (kStatus_HAL_Flash_Success == HAL_FlashProgramUnaligned(dstAddress, (uint16_t)size, cacheBuffer))
            {
            }
            else
            {
                status = gNVM_RecordWriteError_c;
            }
        }
        if (gNVM_OK_c == status)
        {
            /* write the associated record meta information */
            if (kStatus_HAL_Flash_Success !=
                HAL_FlashProgramUnaligned(dstMetaAddress, sizeof(NVM_RecordMetaInfo_t), (uint8_t *)(&dstMetaInfo)))
            {
                status = gNVM_MetaInfoWriteError_c;
            }
        }
    }
    return status;
}

/******************************************************************************
 * Name: NvGetTblEntryMetaAddrFromId
 * Description: Gets the table entry meta address based on table entry ID
 * Parameter(s): [IN] searchStartAddress - the search start address
 *               [IN] dataEntryId - table entry ID
 * Return: the value of the meta address
 *****************************************************************************/
#if gNvFragmentation_Enabled_d
NVM_STATIC uint32_t NvGetTblEntryMetaAddrFromId(uint32_t searchStartAddress, uint16_t dataEntryId)
{
    NVM_RecordMetaInfo_t metaInfo = {0};
    uint32_t             status   = 0U;

    while (searchStartAddress >=
           (mNvVirtualPageProperty[mNvActivePageId].NvRawSectorStartAddress + gNvFirstMetaOffset_c))
    {
        (void)NvGetMetaInfo(mNvActivePageId, searchStartAddress, &metaInfo);

        if ((metaInfo.fields.NvValidationStartByte != gValidationByteAllRecords_c) ||
            (metaInfo.fields.NvValidationStartByte != metaInfo.fields.NvValidationEndByte))
        {
            searchStartAddress -= sizeof(NVM_RecordMetaInfo_t);
            continue;
        }

        if (metaInfo.fields.NvmDataEntryID == dataEntryId)
        {
            /* found it */
            status = searchStartAddress;
            break;
        }

        searchStartAddress -= sizeof(NVM_RecordMetaInfo_t);
    }
    return status;
}

/******************************************************************************
 * Name: NvInternalRecordsUpdate
 * Description: Performs to update nv records
 * Parameter(s): [IN] srcMetaAddr - source page meta address
 *               [IN] srcTblEntryIdx - source page table entry index
 *               [IN] ownerRecordMetaInfo - pointer to the location of a full dataset save
 * Return: the status of the operation
 *****************************************************************************/
NVM_STATIC void NvInternalRecordsUpdate(uint32_t              srcMetaAddr,
                                        uint16_t              srcTblEntryIdx,
                                        NVM_RecordMetaInfo_t *ownerRecordMetaInfo)
{
    NVM_RecordMetaInfo_t metaInfo    = {0};
    uint32_t             metaAddress = srcMetaAddr;

#if gNvDualImageSupport
    NVM_DataEntry_t flashDataEntry;
    /* if the srcTblEntryIdx is invalid, it means the entry may is from NVM, then size should from NVM entry  */
    if (srcTblEntryIdx == gNvInvalidTableEntryIndex_c)
    {
        /* get current meta information */
        (void)NvGetMetaInfo(mNvActivePageId, metaAddress, &metaInfo);
        /* get Entey table from NVM*/
        (void)NvGetTableEntry(metaInfo.fields.NvmDataEntryID, &flashDataEntry);
        /* clear the records offsets buffer */
        FLib_MemSet(maNvRecordsCpyOffsets, 0, (uint32_t)sizeof(uint16_t) * flashDataEntry.ElementsCount);

        FLib_MemSet((uint8_t *)&metaInfo, 0, (uint32_t)sizeof(NVM_RecordMetaInfo_t));
    }
    else
    {
#endif /* gNvDualImageSupport */
        /* clear the records offsets buffer */
        FLib_MemSet(maNvRecordsCpyOffsets, 0,
                    (uint32_t)sizeof(uint16_t) * pNVM_DataTable[srcTblEntryIdx].ElementsCount);
#if gNvDualImageSupport
    }
#endif /* gNvDualImageSupport */

    while (metaAddress > (uint32_t)ownerRecordMetaInfo)
    {
        /* get meta information */
        (void)NvGetMetaInfo(mNvActivePageId, metaAddress, &metaInfo);

        /* skip invalid entries and full table records */
        if ((metaInfo.fields.NvValidationStartByte != metaInfo.fields.NvValidationEndByte) ||
            (metaInfo.fields.NvValidationStartByte != gValidationByteSingleRecord_c))
        {
            metaAddress -= sizeof(NVM_RecordMetaInfo_t);
            continue;
        }

#if gNvDualImageSupport
        if (srcTblEntryIdx == gNvInvalidTableEntryIndex_c)
        {
            /* if the srcTblEntryIdx is invalid, it means the entry may is from NVM, then not need if the element still
             * belongs to an valid RAM  */
            if (metaInfo.fields.NvmElementIndex >= flashDataEntry.ElementsCount)
            {
                /* JIA:maybe something wrong*/
                metaAddress -= sizeof(NVM_RecordMetaInfo_t);
                continue;
            }
        }
        else
        {
#endif /* gNvDualImageSupport */
            /* check if the element still belongs to an valid RAM table entry */
            if (metaInfo.fields.NvmElementIndex >= pNVM_DataTable[srcTblEntryIdx].ElementsCount)
            {
                /* the FLASH element is no longer a current RAM table entry element */
                metaAddress -= sizeof(NVM_RecordMetaInfo_t);
                continue;
            }
#if gNvDualImageSupport
        }
#endif /* gNvDualImageSupport */
        /* found a new single record not copied */
        if ((metaInfo.fields.NvmDataEntryID == ownerRecordMetaInfo->fields.NvmDataEntryID) &&
            (0u == maNvRecordsCpyOffsets[metaInfo.fields.NvmElementIndex]))
        {
            maNvRecordsCpyOffsets[metaInfo.fields.NvmElementIndex] = metaInfo.fields.NvmRecordOffset;
        }
        metaAddress -= sizeof(NVM_RecordMetaInfo_t);
    }
}

