benjaminkravets/KW45B41Z/kw45b41zevk_eatt_central_bm/framework/NVM/source/NV_Flash.c
/******************************************************************************
 * Name: NvInternalDefragmentedCopy
 * Description: Performs defragmentation and copy from the source page to
 *              the destination one
 * Parameter(s): [IN] srcMetaAddr - source page meta address
 *               [IN] srcTblEntryIdx - source page table entry index
 *               [IN] dstMetaAddr - destination meta address
 *               [IN] dstRecordAddr - destination record address (to copy to)
 *               [IN] ownerRecordMetaInfo - pointer to the location of a full dataset save
 * Return: the status of the operation
 *****************************************************************************/
NVM_STATIC NVM_Status_t NvInternalDefragmentedCopy(uint32_t              srcMetaAddr,
                                                   uint16_t              srcTblEntryIdx,
                                                   uint32_t              dstMetaAddr,
                                                   uint32_t              dstRecordAddr,
                                                   NVM_RecordMetaInfo_t *ownerRecordMetaInfo)
{
    NVM_Status_t status = gNVM_OK_c;
#if gNvDualImageSupport
    uint32_t size;
#else  /* gNvDualImageSupport */
    uint32_t size = (uint32_t)pNVM_DataTable[srcTblEntryIdx].ElementSize * pNVM_DataTable[srcTblEntryIdx].ElementsCount;
#endif /* gNvDualImageSupport */
    uint8_t  space_left;
    uint16_t copy_amount;
    uint8_t  dstBuffer[PGM_SIZE_BYTE];
    uint16_t element_idx           = 0U;
    uint8_t  element_inner_copied  = 0U;
    uint32_t written_buffers_count = 0U;

    NVM_RecordMetaInfo_t dstMetaInfo;
#if gNvUseExtendedFeatureSet_d
    NVM_DataEntry_t flashDataEntry;
    bool_t          fillFromRAM = FALSE;

#if gNvDualImageSupport
    NVM_DataEntry_t *    flashDataEntryForSave;
    NVM_RecordMetaInfo_t srcMetaInfo = {0};
    /* if the srcTblEntryIdx is invalid, it means the entry may is from NVM,
       then size should from NVM entry  */
    if (srcTblEntryIdx == gNvInvalidTableEntryIndex_c)
    {
        /* get current meta information */
        (void)NvGetMetaInfo(mNvActivePageId, srcMetaAddr, &srcMetaInfo);
        /* get Entey table from NVM*/
        (void)NvGetTableEntry(srcMetaInfo.fields.NvmDataEntryID, &flashDataEntry);
        size = (uint32_t)flashDataEntry.ElementSize * flashDataEntry.ElementsCount;
    }
    else
    {
        size = (uint32_t)pNVM_DataTable[srcTblEntryIdx].ElementSize * pNVM_DataTable[srcTblEntryIdx].ElementsCount;
    }
#endif /* gNvDualImageSupport */

#endif /* gNvUseExtendedFeatureSet_d */

#if gNvUseExtendedFeatureSet_d

#if gNvDualImageSupport
    /* if the srcTblEntryIdx is invalid, it means the entry may is from NVM,
       then not need to consider RAM table */
    if (srcTblEntryIdx == gNvInvalidTableEntryIndex_c)
    {
        fillFromRAM           = FALSE;
        flashDataEntryForSave = &flashDataEntry;
        // no action needs
    }
    else
    {
        flashDataEntryForSave = &pNVM_DataTable[srcTblEntryIdx];
#endif /* gNvDualImageSupport */
        fillFromRAM = FALSE;
        /* RAM table was updated */
        if (mNvTableUpdated)
        {
            (void)NvGetTableEntry(pNVM_DataTable[srcTblEntryIdx].DataEntryID, &flashDataEntry);
            if (pNVM_DataTable[srcTblEntryIdx].ElementsCount > flashDataEntry.ElementsCount)
            {
                /* fill the FLASH destination page with the default RAM value for the missing element(s) */
                fillFromRAM = TRUE;
            }
        }

#if gNvDualImageSupport
    }
#endif /* gNvDualImageSupport */
#endif /* gNvUseExtendedFeatureSet_d */

    /* Function used to find all valid single offset value for a dataset, the offset value will be stored in
     * maNvRecordsCpyOffsets */
    NvInternalRecordsUpdate(srcMetaAddr, srcTblEntryIdx, ownerRecordMetaInfo);
    while (size != 0u)
    {
        space_left = PGM_SIZE_BYTE;
        FLib_MemSet(dstBuffer, 0xFF, PGM_SIZE_BYTE);

#if gNvDualImageSupport
        /* fill the internal buffer */
        while ((0u != space_left) && (element_idx < flashDataEntryForSave->ElementsCount))
        {
            /* plenty of space left to copy the rest of the element */
            if (space_left >= (flashDataEntryForSave->ElementSize - element_inner_copied))
            {
                copy_amount = flashDataEntryForSave->ElementSize - element_inner_copied;
#if gNvUseExtendedFeatureSet_d
                /* copy the rest of the data from the RAM entry */
                if (fillFromRAM && element_idx >= flashDataEntry.ElementsCount)
                {
                    FLib_MemCpy(
                        dstBuffer + ((uint8_t)PGM_SIZE_BYTE - space_left),
                        (uint8_t *)((uint32_t)(uint32_t *)flashDataEntryForSave->pData +
                                    (uint32_t)element_idx * flashDataEntryForSave->ElementSize + element_inner_copied),
                        copy_amount);
                }
                else
#endif
                    /* copy from the owning full record save if no single save offset was found */
                    if (0u == maNvRecordsCpyOffsets[element_idx])
                {
                    FLib_MemCpy(dstBuffer + ((uint8_t)PGM_SIZE_BYTE - space_left),
                                (uint8_t *)(mNvVirtualPageProperty[mNvActivePageId].NvRawSectorStartAddress +
                                            ownerRecordMetaInfo->fields.NvmRecordOffset +
                                            element_idx * flashDataEntryForSave->ElementSize + element_inner_copied),
                                copy_amount);
                }
                else
                {
                    FLib_MemCpy(dstBuffer + ((uint8_t)PGM_SIZE_BYTE - space_left),
                                (uint8_t *)(mNvVirtualPageProperty[mNvActivePageId].NvRawSectorStartAddress +
                                            maNvRecordsCpyOffsets[element_idx] + element_inner_copied),
                                copy_amount);
                }
                space_left -= (uint8_t)copy_amount;

                /* move to next element */
                element_idx++;
                element_inner_copied = 0;
                continue;
            }
            else
            {
                copy_amount = space_left;
#if gNvUseExtendedFeatureSet_d
                /* copy the rest of the data from the RAM entry */
                if (fillFromRAM && element_idx >= flashDataEntry.ElementsCount)
                {
                    FLib_MemCpy(
                        dstBuffer + ((uint8_t)PGM_SIZE_BYTE - space_left),
                        (uint8_t *)((uint32_t)(uint32_t *)flashDataEntryForSave->pData +
                                    (uint32_t)element_idx * flashDataEntryForSave->ElementSize + element_inner_copied),
                        copy_amount);
                }
                else
#endif
                    /* copy from the owning full record save if no single save offset was found */
                    if (0u == maNvRecordsCpyOffsets[element_idx])
                {
                    FLib_MemCpy(dstBuffer + ((uint8_t)PGM_SIZE_BYTE - space_left),
                                (uint8_t *)(mNvVirtualPageProperty[mNvActivePageId].NvRawSectorStartAddress +
                                            ownerRecordMetaInfo->fields.NvmRecordOffset +
                                            element_idx * flashDataEntryForSave->ElementSize + element_inner_copied),
                                copy_amount);
                }
                else
                {
                    FLib_MemCpy(dstBuffer + ((uint8_t)PGM_SIZE_BYTE - space_left),
                                (uint8_t *)(mNvVirtualPageProperty[mNvActivePageId].NvRawSectorStartAddress +
                                            maNvRecordsCpyOffsets[element_idx] + element_inner_copied),
                                copy_amount);
                }
                element_inner_copied += (uint8_t)copy_amount;
                break;
            }
        }
#else /* gNvDualImageSupport */
        /* fill the internal buffer */
        while ((0u != space_left) && (element_idx < pNVM_DataTable[srcTblEntryIdx].ElementsCount))
        {
            /* plenty of space left to copy the rest of the element */
            if (space_left >= (pNVM_DataTable[srcTblEntryIdx].ElementSize - element_inner_copied))
            {
                copy_amount = pNVM_DataTable[srcTblEntryIdx].ElementSize - element_inner_copied;
#if gNvUseExtendedFeatureSet_d
                /* copy the rest of the data from the RAM entry */
                if (fillFromRAM && element_idx >= flashDataEntry.ElementsCount)
                {
                    FLib_MemCpy(dstBuffer + ((uint8_t)PGM_SIZE_BYTE - space_left),
                                (uint8_t *)((uint32_t)(uint32_t *)pNVM_DataTable[srcTblEntryIdx].pData +
                                            (uint32_t)element_idx * pNVM_DataTable[srcTblEntryIdx].ElementSize +
                                            element_inner_copied),
                                copy_amount);
                }
                else
#endif
                    /* copy from the owning full record save if no single save offset was found */
                    if (0u == maNvRecordsCpyOffsets[element_idx])
                {
                    FLib_MemCpy(
                        dstBuffer + ((uint8_t)PGM_SIZE_BYTE - space_left),
                        (uint8_t *)(mNvVirtualPageProperty[mNvActivePageId].NvRawSectorStartAddress +
                                    ownerRecordMetaInfo->fields.NvmRecordOffset +
                                    element_idx * pNVM_DataTable[srcTblEntryIdx].ElementSize + element_inner_copied),
                        copy_amount);
                }
                else
                {
                    FLib_MemCpy(dstBuffer + ((uint8_t)PGM_SIZE_BYTE - space_left),
                                (uint8_t *)(mNvVirtualPageProperty[mNvActivePageId].NvRawSectorStartAddress +
                                            maNvRecordsCpyOffsets[element_idx] + element_inner_copied),
                                copy_amount);
                }
                space_left -= (uint8_t)copy_amount;

                /* move to next element */
                element_idx++;
                element_inner_copied = 0;
            }
            else
            {
                copy_amount = space_left;
#if gNvUseExtendedFeatureSet_d
                /* copy the rest of the data from the RAM entry */
                if (fillFromRAM && element_idx >= flashDataEntry.ElementsCount)
                {
                    FLib_MemCpy(dstBuffer + ((uint8_t)PGM_SIZE_BYTE - space_left),
                                (uint8_t *)((uint32_t)(uint32_t *)pNVM_DataTable[srcTblEntryIdx].pData +
                                            (uint32_t)element_idx * pNVM_DataTable[srcTblEntryIdx].ElementSize +
                                            element_inner_copied),
                                copy_amount);
                }
                else
#endif
                    /* copy from the owning full record save if no single save offset was found */
                    if (0u == maNvRecordsCpyOffsets[element_idx])
                {
                    FLib_MemCpy(
                        dstBuffer + ((uint8_t)PGM_SIZE_BYTE - space_left),
                        (uint8_t *)(mNvVirtualPageProperty[mNvActivePageId].NvRawSectorStartAddress +
                                    ownerRecordMetaInfo->fields.NvmRecordOffset +
                                    element_idx * pNVM_DataTable[srcTblEntryIdx].ElementSize + element_inner_copied),
                        copy_amount);
                }
                else
                {
                    FLib_MemCpy(dstBuffer + ((uint8_t)PGM_SIZE_BYTE - space_left),
                                (uint8_t *)(mNvVirtualPageProperty[mNvActivePageId].NvRawSectorStartAddress +
                                            maNvRecordsCpyOffsets[element_idx] + element_inner_copied),
                                copy_amount);
                }
                element_inner_copied += (uint8_t)copy_amount;
                break;
            }
        }
#endif /* gNvDualImageSupport */
        /* write the record data */
        if (kStatus_HAL_Flash_Success !=
            HAL_FlashProgramUnaligned(dstRecordAddr + (written_buffers_count * PGM_SIZE_BYTE), PGM_SIZE_BYTE,
                                      dstBuffer))
        {
            status = gNVM_RecordWriteError_c;
            break;
        }
        written_buffers_count++;

        /* copied all the data, exit */
        if (size <= (uint16_t)PGM_SIZE_BYTE)
        {
            break;
        }
        size -= (uint16_t)PGM_SIZE_BYTE;
    }

    if (gNVM_OK_c == status)
    {
        /* write meta information tag */
        dstMetaInfo.fields.NvValidationStartByte = gValidationByteAllRecords_c;
        dstMetaInfo.fields.NvmDataEntryID        = ownerRecordMetaInfo->fields.NvmDataEntryID;
        dstMetaInfo.fields.NvmElementIndex       = 0;
        dstMetaInfo.fields.NvmRecordOffset       = (uint16_t)(uint32_t)(
            dstRecordAddr - mNvVirtualPageProperty[((uint8_t)mNvActivePageId + 1U) % 2U].NvRawSectorStartAddress);
        dstMetaInfo.fields.NvValidationEndByte = gValidationByteAllRecords_c;

        /* the offset has to be 4 bytes aligned, an extra check is performed to avoid further hard faults caused by FTFx
         * controller */
        if ((dstMetaInfo.fields.NvmRecordOffset & (uint16_t)0x3) != 0u)
        {
            status = gNVM_AlignamentError_c;
        }
        else
        {
            /* write the associated record meta information */
            if (kStatus_HAL_Flash_Success !=
                HAL_FlashProgram(dstMetaAddr, sizeof(NVM_RecordMetaInfo_t), (uint8_t *)(&dstMetaInfo)))
            {
                status = gNVM_MetaInfoWriteError_c;
            }
        }
    }
    return status;
}
#endif /* gNvFragmentation_Enabled_d */

