benjaminkravets/KW45B41Z/kw45b41zevk_eatt_central_bm/framework/NVM/source/NV_Flash.c
/******************************************************************************
 * Name: NvIsMetaInfoValid
 * Description: Performs to check is the meta is valid
 * Parameter(s): [IN] srcMetaAddress - point to the variable which stored meta info address
 *               [IN] srcMetaInfo - point to the meta info
 *               [IN] srcTableEntryIdx - point to the variable which stored table entry index
 *               [IN] skipEntryId - point to the variable which stored the entry ID that should skip
 *               [IN] dstPageId - point to the variable which stored the target page ID
 * Return: the status of the operation
 *****************************************************************************/
NVM_STATIC bool_t NvIsMetaInfoValid(uint32_t *            srcMetaAddress,
                                    NVM_RecordMetaInfo_t *srcMetaInfo,
                                    uint16_t *            srcTableEntryIdx,
                                    NvTableEntryId_t      skipEntryId,
                                    NVM_VirtualPageID_t   dstPageId)
{
    bool_t state = TRUE;
#if gNvUseExtendedFeatureSet_d
    uint16_t idx;
    bool_t   entryFound;

#if gNvDualImageSupport
    NVM_DataEntry_t flashDataEntry;
#endif /* gNvDualImageSupport */
#endif /* gNvUseExtendedFeatureSet_d */

    /* do ... while(FALSE) for MISRA 15.5 control flow problem */
    do
    {
#if gNvUseExtendedFeatureSet_d
        /* NV RAM table has been updated */
        /* Check if meta info still in RAM table */
        if (mNvTableUpdated)
        {
            idx        = 0;
            entryFound = FALSE;

            /* check if the saved entry is still present in the new RAM table */
            while (idx < mNVM_DataTableNbEntries)
            {
                if (srcMetaInfo->fields.NvmDataEntryID == pNVM_DataTable[idx].DataEntryID)
                {
                    entryFound = TRUE;
                    break;
                }
                idx++;
            }

            if (!entryFound)
            {
#if gNvDualImageSupport
                /* Not only check if the entry from RAM, but also check if it in NVM*/
                if (NvGetTableEntry(srcMetaInfo->fields.NvmDataEntryID, &flashDataEntry) == false)
                {
                    /* The Table also not found from NVM*/
                    *srcMetaAddress -= sizeof(NVM_RecordMetaInfo_t);
                    state = FALSE;
                    break;
                }
#else  /* gNvDualImageSupport */
                /* move to the next meta info */
                *srcMetaAddress -= sizeof(NVM_RecordMetaInfo_t);
                state = FALSE;
                break;
#endif /* gNvDualImageSupport */
            }
        }
#endif /* gNvUseExtendedFeatureSet_d */

        /* get table entry index */
        *srcTableEntryIdx = NvGetTableEntryIndexFromId(srcMetaInfo->fields.NvmDataEntryID);
        /* Check if VSB ?= VEB */
        if (NvIsRecordCopied(dstPageId, srcMetaInfo) ||
            (srcMetaInfo->fields.NvValidationStartByte != srcMetaInfo->fields.NvValidationEndByte) ||
#if gNvDualImageSupport
            (srcMetaInfo->fields.NvmDataEntryID == skipEntryId))
#else  /* gNvDualImageSupport */
            (*srcTableEntryIdx == gNvInvalidDataEntry_c) || (srcMetaInfo->fields.NvmDataEntryID == skipEntryId))
#endif /* gNvDualImageSupport */
        {
            /* go to the next meta information tag */
            *srcMetaAddress -= sizeof(NVM_RecordMetaInfo_t);
            state = FALSE;
            break;
        }
        /* Check if the  record type is vaild */
        if ((srcMetaInfo->fields.NvValidationStartByte != gValidationByteSingleRecord_c) &&
            (srcMetaInfo->fields.NvValidationStartByte != gValidationByteAllRecords_c))
        {
            /* go to the next meta information tag */
            *srcMetaAddress -= sizeof(NVM_RecordMetaInfo_t);
            state = FALSE;
            break;
        }

#if gUnmirroredFeatureSet_d
#if gNvDualImageSupport
        if (*srcTableEntryIdx != gNvInvalidTableEntryIndex_c)
        {
#endif /* gNvDualImageSupport */
            if (gNVM_MirroredInRam_c != (NVM_DataEntryType_t)pNVM_DataTable[*srcTableEntryIdx].DataEntryType)
            {
                /*check if the data was erased using NvErase or is just uninitialised*/
                if (NULL == ((void **)pNVM_DataTable[*srcTableEntryIdx].pData)[srcMetaInfo->fields.NvmElementIndex] &&
                    NvIsRecordErased(*srcTableEntryIdx, srcMetaInfo->fields.NvmElementIndex, *srcMetaAddress))
                {
                    /* go to the next meta information tag */
                    *srcMetaAddress -= sizeof(NVM_RecordMetaInfo_t);
                    state = FALSE;
                    break;
                }
            }
#if gNvDualImageSupport
        }
#endif /* gNvDualImageSupport */
#endif
    } while (FALSE);

    return state;
}
/******************************************************************************
 * Name: NvIsNvTableChanged
 * Description: Performs to check if the NvTable is changed
 * Parameter(s): [IN] srcMetaAddress - point to the variable which stored meta info address
 *               [IN] srcMetaInfo - point to the meta info
 *               [IN] srcTableEntryIdx - point to the variable which stored table entry index
 *               [IN] tableUpgraded - point to the variable which stored the state of if a table upgrate is happend
 *               [IN] bytesToCopy - point to the variable which stored how many bytes should copy
 * Return: the status of the operation
 *****************************************************************************/
NVM_STATIC bool_t NvIsNvTableChanged(uint32_t *            srcMetaAddress,
                                     NVM_RecordMetaInfo_t *srcMetaInfo,
                                     uint16_t *            srcTableEntryIdx,
#if gNvUseExtendedFeatureSet_d
                                     bool_t *tableUpgraded,
#endif /* gNvUseExtendedFeatureSet_d */
                                     uint32_t *bytesToCopy)
{
    bool_t status = FALSE;

#if gNvUseExtendedFeatureSet_d
    NVM_DataEntry_t flashDataEntry;

    /* do ... while(FALSE) for MISRA 15.5 control flow problem */
    do
    {
        /* NV RAM table has been updated */
        if (mNvTableUpdated)
        {
            if (NvGetTableEntry(pNVM_DataTable[*srcTableEntryIdx].DataEntryID, &flashDataEntry))
            {
                /* entries changed from mirrored/unmirrored and with different entry size cannot be recovered */
                if ((((gNVM_MirroredInRam_c == (NVM_DataEntryType_t)flashDataEntry.DataEntryType) ||
                      (gNVM_MirroredInRam_c == (NVM_DataEntryType_t)pNVM_DataTable[*srcTableEntryIdx].DataEntryType)) &&
                     (flashDataEntry.DataEntryType != pNVM_DataTable[*srcTableEntryIdx].DataEntryType)) ||
                    (flashDataEntry.ElementSize != pNVM_DataTable[*srcTableEntryIdx].ElementSize))
                {
                    *srcMetaAddress -= sizeof(NVM_RecordMetaInfo_t);
                    status = TRUE;
                    break;
                }

                if (flashDataEntry.ElementsCount != pNVM_DataTable[*srcTableEntryIdx].ElementsCount)
                {
                    if (*tableUpgraded)
                    {
                        if (flashDataEntry.ElementsCount < pNVM_DataTable[*srcTableEntryIdx].ElementsCount)
                        {
                            /* copy only the bytes that were previously written to FLASH virtual page */
                            *bytesToCopy = (uint32_t)flashDataEntry.ElementsCount * flashDataEntry.ElementSize;
                        }
#if gNvFragmentation_Enabled_d
                        /*ignore if out of bounds*/
                        if (srcMetaInfo->fields.NvValidationStartByte == gValidationByteSingleRecord_c &&
                            srcMetaInfo->fields.NvmElementIndex >= pNVM_DataTable[*srcTableEntryIdx].ElementsCount)
                        {
                            *srcMetaAddress -= sizeof(NVM_RecordMetaInfo_t);
                            status = TRUE;
                            break;
                        }
#endif
                    }
                    else
                    {
                        *srcMetaAddress -= sizeof(NVM_RecordMetaInfo_t);
                        status = TRUE;
                        break;
                    }
                }
            }
        }
    } while (FALSE);
#endif /* gNvUseExtendedFeatureSet_d */
    return status;
}
/******************************************************************************
 * Name: NvCopyRecord
 * Description: Performs to copy the record to another page
 * Parameter(s): [IN] dstMetaAddress - point to the variable which stored the target meta info address
 *               [IN] srcMetaAddress - point to the variable which stored meta info address
 *               [IN] srcMetaInfo - point to the meta info
 *               [IN] dstRecordAddress - point to the variable which stored the target record address
 *               [IN] srcTableEntryIdx - point to the variable which stored table entry index
 *               [IN] tblEntryMetaAddress - point to the variable which stored table entry meta address
 *               [IN] tableUpgraded - point to the variable which stored the state of if a table upgrate is happend
 *               [IN] bytesToCopy - point to the variable which stored how many bytes should copy
 * Return: the status of the operation
 *****************************************************************************/
NVM_STATIC NVM_Status_t NvCopyRecord(uint32_t *            dstMetaAddress,
                                     uint32_t *            srcMetaAddress,
                                     NVM_RecordMetaInfo_t *srcMetaInfo,
                                     uint32_t *            dstRecordAddress,
                                     uint16_t *            srcTableEntryIdx,
#if gNvFragmentation_Enabled_d
                                     uint32_t *tblEntryMetaAddress,
#endif /* gNvFragmentation_Enabled_d */
#if gNvUseExtendedFeatureSet_d
                                     bool_t *tableUpgraded,
#endif /* gNvUseExtendedFeatureSet_d */
                                     uint32_t *bytesToCopy)
{
    NVM_Status_t status;
    /* if the copy operation must take elements from ram */
#if gNvUseExtendedFeatureSet_d

#if gNvDualImageSupport
    NVM_DataEntry_t flashDataEntry;
    /* if the srcTableEntryIdx is invalid, it means the entry is from NVM,
       then it not need to check if NvTable is changed from RAM  */
    if (*srcTableEntryIdx == gNvInvalidTableEntryIndex_c)
    {
        NvGetTableEntry(srcMetaInfo->fields.NvmDataEntryID, &flashDataEntry);

