benjaminkravets/KW45B41Z/kw45b41zevk_eatt_central_bm/framework/NVM/source/NV_Flash.c
        if (mNvTableUpdated && *tableUpgraded &&
            *bytesToCopy < (uint32_t)flashDataEntry.ElementsCount * flashDataEntry.ElementSize)
        {
            /* make sure the adress can hold the entire space (+ what is taken from ram) */
            *dstRecordAddress -= NvUpdateSize((uint32_t)flashDataEntry.ElementsCount * flashDataEntry.ElementSize);
        }
        else
        {
            /* compute the destination record start address */
            *dstRecordAddress -= NvUpdateSize(*bytesToCopy);
        }
    }
    else
#endif /* gNvDualImageSupport */
        if (mNvTableUpdated && *tableUpgraded &&
            *bytesToCopy < (uint32_t)pNVM_DataTable[*srcTableEntryIdx].ElementsCount *
                               pNVM_DataTable[*srcTableEntryIdx].ElementSize)
    {
        /* make sure the adress can hold the entire space (+ what is taken from ram) */
        *dstRecordAddress -= NvUpdateSize((uint32_t)pNVM_DataTable[*srcTableEntryIdx].ElementsCount *
                                          pNVM_DataTable[*srcTableEntryIdx].ElementSize);
    }
    else
#endif
    {
        /* compute the destination record start address */
        *dstRecordAddress -= NvUpdateSize(*bytesToCopy);
    }

#if gNvFragmentation_Enabled_d
    /*
     * single element record
     */
    if (srcMetaInfo->fields.NvValidationStartByte == gValidationByteSingleRecord_c)
    {
        status = NvInternalDefragmentedCopy(*srcMetaAddress, *srcTableEntryIdx, *dstMetaAddress, *dstRecordAddress,
                                            (NVM_RecordMetaInfo_t *)(*tblEntryMetaAddress));
    }
    else
#endif /* gNvFragmentation_Enabled_d */
    /*
     * full table entry
     */
    {
        status = NvInternalCopy(*dstRecordAddress, *dstMetaAddress, srcMetaInfo, *srcTableEntryIdx,
                                (uint16_t)(*bytesToCopy));
    }

    return status;
}

/******************************************************************************
 * Name: NvCopyPage
 * Description: Copy the active page content to the mirror page. Only the
 *              latest table entries / elements are copied. A merge operation
 *              is performed before copy if an entry has single elements
 *              saved priori and newer than the table entry. If one or more
 *              elements were singular saved and the NV page doesn't has a
 *              full table entry saved, then the elements are copied as they
 *              are.
 * Parameter(s): [IN] skipEntryId - the entry ID to be skipped when page
 *                                  copy is performed
 * Return: gNVM_InvalidPageID_c - if the source or destination page is not
 *                                valid
 *         gNVM_MetaInfoWriteError_c - if the meta information couldn't be
 *                                     written
 *         gNVM_RecordWriteError_c - if the record couldn't be written
 *         gNVM_Error_c - in case of error(s)
 *         gNVM_OK_c - page copy completed successfully
 *****************************************************************************/
NVM_STATIC NVM_Status_t NvCopyPage(NvTableEntryId_t skipEntryId)
{
    /* source page related variables */
    uint32_t             srcMetaAddress;
    NVM_RecordMetaInfo_t srcMetaInfo = {0};
    uint16_t             srcTableEntryIdx;

    /* destination page related variables */
    uint32_t            dstMetaAddress;
    uint32_t            firstMetaAddress;
    NVM_VirtualPageID_t dstPageId;
    uint32_t            dstRecordAddress;

#if gNvUseExtendedFeatureSet_d
    bool_t tableUpgraded = FALSE;
#endif /* gNvUseExtendedFeatureSet_d */
#if gNvFragmentation_Enabled_d
    uint32_t tblEntryMetaAddress = 0;
#endif
    uint32_t bytesToCopy;
#if gNvDualImageSupport
    NVM_DataEntry_t flashDataEntry;
#endif /* gNvDualImageSupport */
    /* status variable */
    NVM_Status_t status = gNVM_OK_c;

    dstPageId = (NVM_VirtualPageID_t)(uint8_t)(((uint8_t)mNvActivePageId + 1u) % 2u);

    /* Check if the destination page is blank. If not, erase it. */
    if (gNVM_PageIsNotBlank_c == NvVirtualPageBlankCheck(dstPageId))
    {
        status = NvEraseVirtualPage(dstPageId);
    }
    if (gNVM_OK_c == status)
    {
        /* initialise the destination page meta info start address */
        dstMetaAddress = mNvVirtualPageProperty[dstPageId].NvRawSectorStartAddress + gNvFirstMetaOffset_c;
#if gNvDualImageSupport
        dstMetaAddress += (sizeof(NVM_TableInfo_t) * gNeedAddEntryCnt);
#endif /* gNvDualImageSupport */
#if gNvUseExtendedFeatureSet_d
        if (mNvTableUpdated)
        {
            tableUpgraded = (GetFlashTableVersion() != mNvFlashTableVersion);
        }
#endif

        firstMetaAddress = dstMetaAddress;
        /*if src is an empty page, just copy the table and make the initialisations*/
        srcMetaAddress = mNvVirtualPageProperty[mNvActivePageId].NvLastMetaInfoAddress;
        if (srcMetaAddress != gEmptyPageMetaAddress_c)
        {
            /* initialise the destination page record start address */
            dstRecordAddress = mNvVirtualPageProperty[dstPageId].NvRawSectorEndAddress - sizeof(NVM_TableInfo_t) + 1U;

            while (srcMetaAddress >=
                   (mNvVirtualPageProperty[mNvActivePageId].NvRawSectorStartAddress + gNvFirstMetaOffset_c))
            {
                /* get current meta information */
                (void)NvGetMetaInfo(mNvActivePageId, srcMetaAddress, &srcMetaInfo);

                /* Check if meta info is vaild */
                if (!NvIsMetaInfoValid(&srcMetaAddress, &srcMetaInfo, &srcTableEntryIdx, skipEntryId, dstPageId))
                {
                    continue;
                }
#if gNvDualImageSupport
                /* if meta info is vaild, but the srcTableEntryIdx is invalid, it means the entry is from NVM,
                   then it not need to check if NvTable is changed from RAM  */
                if (srcTableEntryIdx == gNvInvalidTableEntryIndex_c)
                {
                    NvGetTableEntry(srcMetaInfo.fields.NvmDataEntryID, &flashDataEntry);
                    /* compute the destination record start address */
                    bytesToCopy = (uint32_t)flashDataEntry.ElementsCount * flashDataEntry.ElementSize;
                }
                else
                {
#endif /* gNvDualImageSupport */
                    /* compute the destination record start address */
                    bytesToCopy = (uint32_t)pNVM_DataTable[srcTableEntryIdx].ElementsCount *
                                  pNVM_DataTable[srcTableEntryIdx].ElementSize;

                    /* Check if NvTable is changed */
                    if (NvIsNvTableChanged(&srcMetaAddress, &srcMetaInfo, &srcTableEntryIdx,
#if gNvUseExtendedFeatureSet_d
                                           &tableUpgraded,
#endif /* gNvUseExtendedFeatureSet_d */
                                           &bytesToCopy))
                    {
                        continue;
                    }
#if gNvDualImageSupport
                }
#endif /* gNvDualImageSupport */

#if gNvFragmentation_Enabled_d
                if (srcMetaInfo.fields.NvValidationStartByte == gValidationByteSingleRecord_c)
                {
#if gUnmirroredFeatureSet_d

#if gNvDualImageSupport
                    /* if meta info is vaild, but the srcTableEntryIdx is invalid, it means the entry is from NVM,
                       then it not need to check if NvTable is changed from RAM  */
                    if (srcTableEntryIdx == gNvInvalidTableEntryIndex_c)
                    {
                        if (gNVM_MirroredInRam_c != flashDataEntry.DataEntryType)
                        {
                            tblEntryMetaAddress = 0;
                        }
                        else
                        {
                            tblEntryMetaAddress =
                                NvGetTblEntryMetaAddrFromId(srcMetaAddress, srcMetaInfo.fields.NvmDataEntryID);
                        }
                    }
                    else
#endif /* gNvDualImageSupport */
                        if (gNVM_MirroredInRam_c != (NVM_DataEntryType_t)pNVM_DataTable[srcTableEntryIdx].DataEntryType)
                    {
                        tblEntryMetaAddress = 0;
                    }
                    else
#endif
                    {
                        tblEntryMetaAddress =
                            NvGetTblEntryMetaAddrFromId(srcMetaAddress, srcMetaInfo.fields.NvmDataEntryID);
                    }

                    if (NvLookAheadInPendingSaveQueue(&mNvPendingSavesQueue, srcMetaInfo.fields.NvmDataEntryID,
                                                      srcMetaInfo.fields.NvmElementIndex) != (uint8_t)OP_NONE)
                    {
                        /* skip and continue : either we found a pending save operation that will obliterate the same
                         * element or the whole array */
                        /* move to the next meta info */
                        srcMetaAddress -= sizeof(NVM_RecordMetaInfo_t);
                        continue;
                    }

