benjaminkravets/KW45B41Z/kw45b41zevk_eatt_central_bm/framework/NVM/source/NV_Flash.c
                    /* if the record has no full entry associated perform simple copy */
                    if (tblEntryMetaAddress == 0u)
                    {
                        /* compute the 'real record size' taking into consideration that the FTFL controller only writes
                         * in burst of 4 bytes */
#if gNvDualImageSupport
                        /* if the srcTableEntryIdx is invalid, it means the entry is from NVM,
                           then it not need to check if NvTable is changed from RAM  */
                        if (srcTableEntryIdx == gNvInvalidTableEntryIndex_c)
                        {
                            /* compute the destination record start address */
                            bytesToCopy = flashDataEntry.ElementSize;
                        }
                        else
                        {
#endif /* gNvDualImageSupport */
                            bytesToCopy = pNVM_DataTable[srcTableEntryIdx].ElementSize;

#if gNvDualImageSupport
                        }
#endif /* gNvDualImageSupport */
                        dstRecordAddress -= NvUpdateSize(bytesToCopy);

                        status = NvInternalCopy(dstRecordAddress, dstMetaAddress, &srcMetaInfo, srcTableEntryIdx,
                                                (uint16_t)bytesToCopy);
                        if (status != gNVM_OK_c)
                        {
                            break;
                        }
#if gUnmirroredFeatureSet_d
#if gNvDualImageSupport
                        /* if the srcTableEntryIdx is invalid, it means the entry is from NVM,
                           then it not need to check if NvTable is changed from RAM  */
                        if (srcTableEntryIdx == gNvInvalidTableEntryIndex_c)
                        {
                            // no action needs
                        }
                        else
                        {
#endif /* gNvDualImageSupport */
                            if (gNVM_MirroredInRam_c !=
                                (NVM_DataEntryType_t)pNVM_DataTable[srcTableEntryIdx].DataEntryType)
                            {
                                OSA_InterruptDisable();
                                /* set the pointer to the flash data */
                                if (NvIsNVMFlashAddress(((void **)pNVM_DataTable[srcTableEntryIdx]
                                                             .pData)[srcMetaInfo.fields.NvmElementIndex]))
                                {
                                    ((uint8_t **)pNVM_DataTable[srcTableEntryIdx]
                                         .pData)[srcMetaInfo.fields.NvmElementIndex] = (uint8_t *)dstRecordAddress;
                                }
                                OSA_InterruptEnable();
                            }
#if gNvDualImageSupport
                        }
#endif /* gNvDualImageSupport */
#endif
                        /* update destination meta information address */
                        dstMetaAddress += sizeof(NVM_RecordMetaInfo_t);

                        /* move to the next meta info */
                        srcMetaAddress -= sizeof(NVM_RecordMetaInfo_t);
                        continue;
                    }
                }
#endif
                /* Copy record operation */
                status =
                    NvCopyRecord(&dstMetaAddress, &srcMetaAddress, &srcMetaInfo, &dstRecordAddress, &srcTableEntryIdx,
#if gNvFragmentation_Enabled_d
                                 &tblEntryMetaAddress,
#endif
#if gNvUseExtendedFeatureSet_d
                                 &tableUpgraded,
#endif
                                 &bytesToCopy);
                if (gNVM_OK_c != status)
                {
                    break;
                }

                /* update destination meta information address */
                dstMetaAddress += sizeof(NVM_RecordMetaInfo_t);

                /* move to the next meta info */
                srcMetaAddress -= sizeof(NVM_RecordMetaInfo_t);
            };
        }

        if (gNVM_OK_c == status)
        {
            /* make a request to erase the old page */
            mNvErasePgCmdStatus.NvPageToErase   = mNvActivePageId;
            mNvErasePgCmdStatus.NvSectorAddress = mNvVirtualPageProperty[mNvActivePageId].NvRawSectorStartAddress;
            mNvErasePgCmdStatus.NvErasePending  = TRUE;

            /* update the the active page ID */
#if gNvDualImageSupport
            gPreviousActivePageId = mNvActivePageId;
#endif /* gNvDualImageSupport */
            mNvActivePageId = dstPageId;

            /* update the last meta info address */
            if (dstMetaAddress == firstMetaAddress)
            {
                mNvVirtualPageProperty[mNvActivePageId].NvLastMetaInfoAddress = gEmptyPageMetaAddress_c;
            }
            else
            {
                mNvVirtualPageProperty[mNvActivePageId].NvLastMetaInfoAddress =
                    dstMetaAddress - sizeof(NVM_RecordMetaInfo_t);
            }

#if gUnmirroredFeatureSet_d
            mNvVirtualPageProperty[mNvActivePageId].NvLastMetaUnerasedInfoAddress =
                mNvVirtualPageProperty[mNvActivePageId].NvLastMetaInfoAddress;
#endif

            mNvPageCounter++;
            /* save the current RAM table */
            if (!NvSaveRamTable(dstPageId))
            {
                status = gNVM_Error_c;
            }
            else
            {
#if gNvUseExtendedFeatureSet_d
                if (mNvTableUpdated)
                {
                    /* update the size of the NV table stored in FLASH */
                    mNvTableSizeInFlash = NvGetFlashTableSize();

                    /* clear the flag */
                    mNvTableUpdated = FALSE;
                }
#endif /* gNvUseExtendedFeatureSet_d */
            }
        }
    }
    return status;
}

/******************************************************************************
 * Name: NvInternalFormat
 * Description: Format the NV storage system. The function erases in place both
 *              virtual pages and then writes the page counter value to first
 *              virtual page. The provided page counter value is automatically
 *              incremented and then written to first (active) virtual page.
 * Parameter(s): [IN] pageCounterValue - the page counter value that will
 *                                       be incremented and then written to
 *                                       active page
 * Return: gNVM_OK_c - if the operation completes successfully
 *         gNVM_FormatFailure_c - if the format operation fails
 *****************************************************************************/
NVM_STATIC NVM_Status_t NvInternalFormat(uint32_t pageCounterValue)
{
    uint8_t      retryCount = gNvFormatRetryCount_c;
    NVM_Status_t status;

    /* increment the page counter value */
    if (pageCounterValue == (uint32_t)gPageCounterMaxValue_c - 1U)
    {
        pageCounterValue = 1;
    }
    else
    {
        pageCounterValue++;
    }
    mNvPageCounter = pageCounterValue;

