benjaminkravets/KW45B41Z/kw45b41zevk_eatt_central_bm/framework/NVM/source/NV_Flash.c
    while (retryCount-- != 0u)
    {
        /* erase first page */
        if (gNVM_OK_c == NvEraseVirtualPage(gFirstVirtualPage_c))
        {
            if (gNVM_OK_c == NvEraseVirtualPage(gSecondVirtualPage_c))
            {
                break;
            }
        }
    }
#if gNvDualImageSupport
    gPreviousActivePageId = gVirtualPageNone_c;
#endif /* gNvDualImageSupport */
    /* active page after format = first virtual page */
    mNvActivePageId = gFirstVirtualPage_c;

    /* save NV table from RAM memory to FLASH memory */
    if (FALSE == NvSaveRamTable(mNvActivePageId))
    {
        status = gNVM_FormatFailure_c;
    }
    else
    {
#if gNvUseExtendedFeatureSet_d
        /* update the size of the NV table stored in FLASH */
        mNvTableSizeInFlash = NvGetFlashTableSize();
#endif

        /* update the page counter value */
        mNvPageCounter = pageCounterValue;

        status = NvUpdateLastMetaInfoAddress();
    }
    return status;
}

/******************************************************************************
 * Name: NvSaveRamTable
 * Description: Saves the NV table
 * Parameter(s): [IN] pageId - the virtual page ID where the table will be
 *                             saved
 * Return: TRUE if table saved successfully, FALSE otherwise
 ******************************************************************************/
NVM_STATIC bool_t NvSaveRamTable(NVM_VirtualPageID_t pageId)
{
    uint64_t tmp;
    uint32_t addr;
#if gNvUseExtendedFeatureSet_d
    bool_t ret = FALSE;
#endif
    bool_t status = FALSE;

    assert(NULL != pNVM_DataTable);
    /* write table qualifier start */
    addr = mNvVirtualPageProperty[pageId].NvRawSectorStartAddress;

#if gNvUseExtendedFeatureSet_d
    tmp = ((NVM_TableInfo_t){.fields.NvPageCounter  = mNvPageCounter,
                             .fields.NvTableMarker  = mNvTableMarker,
                             .fields.NvTableVersion = mNvFlashTableVersion})
              .rawValue;
#else
    tmp = ((NVM_TableInfo_t){.fields.NvPageCounter = mNvPageCounter}).rawValue;
#endif
    /*write page counter, table amrker, table version top*/
    if (kStatus_HAL_Flash_Success == HAL_FlashProgram(addr, sizeof(NVM_TableInfo_t), (uint8_t *)(&tmp)))
    {
#if gNvUseExtendedFeatureSet_d
        addr += sizeof(NVM_TableInfo_t);
#if gNvDualImageSupport
        ret = NvSaveAllDataSetEntry(&addr);
#else /* gNvDualImageSupport */
        for (uint16_t idx = 0; idx < mNVM_DataTableNbEntries; idx++)
        {
            /* write data entry ID */
            tmp = ((NVM_EntryInfo_t){.fields.NvDataEntryID   = pNVM_DataTable[idx].DataEntryID,
                                     .fields.NvDataEntryType = pNVM_DataTable[idx].DataEntryType,
                                     .fields.NvElementsCount = pNVM_DataTable[idx].ElementsCount,
                                     .fields.NvElementSize   = pNVM_DataTable[idx].ElementSize})
                      .rawValue;
            if (kStatus_HAL_Flash_Success != HAL_FlashProgram(addr, sizeof(NVM_EntryInfo_t), (uint8_t *)(&tmp)))
            {
                ret = TRUE;
                break;
            }
            /* increment address */
            addr += sizeof(NVM_EntryInfo_t);

            /* increment table entry index */
        }
#endif

        if (FALSE == ret)
        {
            tmp = ((NVM_TableInfo_t){.fields.NvTableMarker = mNvTableMarker}).rawValue;
            /* write table qualifier end, the rest 6 bytes are left 0x00 */
            if (kStatus_HAL_Flash_Success != HAL_FlashProgram(addr, sizeof(NVM_EntryInfo_t), (uint8_t *)(&tmp)))
            {
                ret = TRUE;
            }
        }
        if (FALSE == ret)
#endif
        {
            /*write page counter bottom*/
            tmp = ((NVM_TableInfo_t){.fields.NvPageCounter = mNvPageCounter}).rawValue;
            if (kStatus_HAL_Flash_Success ==
                HAL_FlashProgram((mNvVirtualPageProperty[pageId].NvRawSectorEndAddress - sizeof(NVM_TableInfo_t) + 1U),
                                 sizeof(NVM_TableInfo_t), (uint8_t *)&tmp))
            {
                status = TRUE;
            }
        }
    }
    return status;
}
#if (!defined(gNvLegacyTable_Disabled_d) || (gNvLegacyTable_Disabled_d == 0))
/******************************************************************************
 * Name: UpgradeLegacyTableToFlash
 * Description: Performs to update LegacyTable To Flash
 * Parameter(s): [IN] read_address - read address
 *               [IN] dstPageId - the page ID
 *               [IN] tableData - the table data
 *               [IN] legacy_page_counter - the legacy page counter
 *               [IN] last_record_offset - the last record offset
 * Return: the status of the operation
 *****************************************************************************/
NVM_STATIC NVM_Status_t UpgradeLegacyTableToFlash(uint32_t            read_address,
                                                  NVM_VirtualPageID_t dstPageId,
                                                  NVM_TableInfo_t     tableData,
                                                  uint32_t            legacy_page_counter,
                                                  uint16_t            last_record_offset)
{
    NVM_Status_t status = gNVM_OK_c;

    if (read_address >= mNvVirtualPageProperty[mNvActivePageId].NvRawSectorEndAddress)
    {
        status = gNVM_AddressOutOfRange_c;
    }
    else
    {
        /* copy the data */
#if (defined(FTFx_PHRASE_SIZE) && (PGM_SIZE_BYTE == FTFx_PHRASE_SIZE))
        if (kStatus_HAL_Flash_Success !=
            HAL_FlashProgram(
                mNvVirtualPageProperty[dstPageId].NvRawSectorStartAddress + last_record_offset,
                mNvVirtualPageProperty[mNvActivePageId].NvTotalPageSize - last_record_offset -
                    sizeof(legacy_page_counter) - 4,
                (uint8_t *)mNvVirtualPageProperty[mNvActivePageId].NvRawSectorStartAddress + last_record_offset))
#else
        if (kStatus_HAL_Flash_Success !=
            HAL_FlashProgram(
                mNvVirtualPageProperty[dstPageId].NvRawSectorStartAddress + last_record_offset -
                    sizeof(legacy_page_counter),
                mNvVirtualPageProperty[mNvActivePageId].NvTotalPageSize - last_record_offset -
                    sizeof(legacy_page_counter),
                (uint8_t *)mNvVirtualPageProperty[mNvActivePageId].NvRawSectorStartAddress + last_record_offset))
#endif
        {
            status = gNVM_Error_c;
        }
        else
        {
            /* write page counter, table marker, table version top */
#if gNvUseExtendedFeatureSet_d
            tableData = ((NVM_TableInfo_t){.fields.NvPageCounter  = legacy_page_counter,
                                           .fields.NvTableMarker  = mNvTableMarker,
                                           .fields.NvTableVersion = 1});
#else
            tableData = ((NVM_TableInfo_t){.fields.NvPageCounter = mNvPageCounter});
#endif

            if (kStatus_HAL_Flash_Success != HAL_FlashProgram(mNvVirtualPageProperty[dstPageId].NvRawSectorStartAddress,
                                                              sizeof(NVM_TableInfo_t), (uint8_t *)(&tableData)))
            {
                status = gNVM_Error_c;
            }
            else
            {
                /* write page counter bottom */
                tableData = ((NVM_TableInfo_t){.fields.NvPageCounter = legacy_page_counter});
                if (kStatus_HAL_Flash_Success !=
                    HAL_FlashProgram(
                        (mNvVirtualPageProperty[dstPageId].NvRawSectorEndAddress - sizeof(NVM_TableInfo_t) + 1U),
                        sizeof(NVM_TableInfo_t), (uint8_t *)&tableData))
                {
                    status = gNVM_Error_c;
                }
                else
                {
                    /* erase old page */
                    mNvErasePgCmdStatus.NvPageToErase = mNvActivePageId;
                    mNvErasePgCmdStatus.NvSectorAddress =
                        mNvVirtualPageProperty[mNvActivePageId].NvRawSectorStartAddress;
                    mNvErasePgCmdStatus.NvErasePending = TRUE;
                    /* set new active page */
                    mNvActivePageId = dstPageId;
                    status          = gNVM_OK_c;
                }
            }
        }
    }
    return status;
}

