benjaminkravets/KW45B41Z/kw45b41zevk_eatt_central_bm/framework/NVM/source/NV_Flash.c
/******************************************************************************
 * Name: UpgradeLegacyTable
 * Description: Upgrades an legacy table to the new format
 * Parameter(s): -
 * Return: -
 *****************************************************************************/
NVM_STATIC NVM_Status_t UpgradeLegacyTable(void)
{
    NVM_Status_t         status = gNVM_OK_c;
    uint32_t             legacy_page_counter;
    uint32_t             read_address;
    uint16_t             offset;
    uint16_t             last_record_offset = 0;
    NVM_RecordMetaInfo_t meta;
    NVM_TableInfo_t      tableData = {0};

#if gNvUseExtendedFeatureSet_d
    uint32_t        legacy_table_marker;
    uint32_t        value;
    NVM_EntryInfo_t tableEntry;
    bool_t          ret = FALSE;
#endif
    NVM_VirtualPageID_t dstPageId = (NVM_VirtualPageID_t)(uint8_t)(((uint8_t)mNvActivePageId + 1U) % 2U);

    /* Check if the destination page is blank. If not, erase it. */
    if (gNVM_PageIsNotBlank_c == NvVirtualPageBlankCheck(dstPageId))
    {
        status = NvEraseVirtualPage(dstPageId);
    }
    if (gNVM_OK_c == status)
    {
        /* read legacy page counter */
        read_address = mNvVirtualPageProperty[mNvActivePageId].NvRawSectorStartAddress;
        NV_FlashRead((uint8_t *)read_address, (uint8_t *)&legacy_page_counter, sizeof(legacy_page_counter));
        legacy_page_counter += 1U;
        offset = (uint16_t)sizeof(NVM_TableInfo_t);
        read_address += sizeof(legacy_page_counter);
        /* copy the flash table */
#if gNvUseExtendedFeatureSet_d
#if (defined(FTFx_PHRASE_SIZE) && (PGM_SIZE_BYTE == FTFx_PHRASE_SIZE))
        /* 4 0xFF allignement bytes */
        read_address += 4;
#endif
        NV_FlashRead((uint8_t *)read_address, (uint8_t *)&legacy_table_marker, sizeof(legacy_table_marker));
        read_address += sizeof(legacy_table_marker);
#if (defined(FTFx_PHRASE_SIZE) && (PGM_SIZE_BYTE == FTFx_PHRASE_SIZE))
        /* 4 0xFF allignement bytes */
        read_address += 4;
#endif
        while (read_address < mNvVirtualPageProperty[mNvActivePageId].NvRawSectorEndAddress)
        {
            NV_FlashRead((uint8_t *)read_address, (uint8_t *)&value, sizeof(value));
            if (legacy_table_marker == value)
            {
                break;
            }

            NV_FlashRead((uint8_t *)read_address, (uint8_t *)&tableEntry, sizeof(tableEntry));
/* upgrade entry */
#if (defined(FTFx_PHRASE_SIZE) && (PGM_SIZE_BYTE == FTFx_PHRASE_SIZE))
            value                             = tableEntry.fields.NvElementSize;
            tableEntry.fields.NvElementSize   = tableEntry.fields.NvDataEntryID;
            tableEntry.fields.NvDataEntryID   = value;
            tableEntry.fields.NvElementsCount = tableEntry.fields.NvDataEntryType;
#else
            value = tableEntry.fields.NvElementsCount;
            tableEntry.fields.NvElementsCount = tableEntry.fields.NvElementSize;
            tableEntry.fields.NvElementSize = (uint16_t)value;
            tableEntry.fields.NvDataEntryID = tableEntry.fields.NvDataEntryType;
#endif
            tableEntry.fields.NvDataEntryType = (uint16_t)gNVM_MirroredInRam_c;

#if gUnmirroredFeatureSet_d
            /* search in the ram table for the entry type, if it doesn't then default to mirrored */
            value = NvGetTableEntryIndexFromId(tableEntry.fields.NvDataEntryID);
            if ((gNvInvalidTableEntryIndex_c != value) &&
                (pNVM_DataTable[value].ElementsCount == tableEntry.fields.NvElementsCount) &&
                (pNVM_DataTable[value].ElementSize == tableEntry.fields.NvElementSize))
            {
                tableEntry.fields.NvDataEntryType = pNVM_DataTable[value].DataEntryType;
            }
#endif
            /*write table entries to the destination page*/
            if (kStatus_HAL_Flash_Success !=
                HAL_FlashProgram(mNvVirtualPageProperty[dstPageId].NvRawSectorStartAddress + offset,
                                 sizeof(NVM_EntryInfo_t), (uint8_t *)&tableEntry))
            {
                status = gNVM_Error_c;
                ret    = TRUE;
                break;
            }
            offset += sizeof(NVM_EntryInfo_t);
            read_address += sizeof(NVM_EntryInfo_t);
        }
        if (gNVM_OK_c == status)
        {
            if (read_address >= mNvVirtualPageProperty[mNvActivePageId].NvRawSectorEndAddress)
            {
                status = gNVM_AddressOutOfRange_c;
                ret    = TRUE;
            }
            else
            {
                tableData = ((NVM_TableInfo_t){.fields.NvTableMarker = mNvTableMarker});
                /* write table qualifier end, the rest 6 bytes are left 0x00 */
                if (kStatus_HAL_Flash_Success !=
                    HAL_FlashProgram(mNvVirtualPageProperty[dstPageId].NvRawSectorStartAddress + offset,
                                     sizeof(NVM_TableInfo_t), (uint8_t *)(&tableData)))
                {
                    status = gNVM_Error_c;
                    ret    = TRUE;
                }
                else
                {
                    read_address += sizeof(legacy_table_marker);
                    offset += sizeof(NVM_TableInfo_t);
                }
            }
        }
        if (FALSE == ret)
#endif
        {
#if (defined(FTFx_PHRASE_SIZE) && (PGM_SIZE_BYTE == FTFx_PHRASE_SIZE))
            /* 4 0xFF allignement bytes */
            read_address += 4;
#endif

            /* copy metas */
            while (read_address < mNvVirtualPageProperty[mNvActivePageId].NvRawSectorEndAddress)
            {
                NV_FlashRead((uint32_t *)read_address, (uint8_t *)&meta, sizeof(NVM_RecordMetaInfo_t));
                if (gNvGuardValue_c == meta.rawValue)
                {
                    break;
                }
#if (defined(FTFx_PHRASE_SIZE) && (PGM_SIZE_BYTE == FTFx_PHRASE_SIZE))
                if (0u != meta.fields.NvmRecordOffset)
                {
                    last_record_offset = meta.fields.NvmRecordOffset;
                }
#else
                /* adjust the meta offset */
                if (0u != meta.fields.NvmRecordOffset)
                {
                    last_record_offset = meta.fields.NvmRecordOffset;
                    meta.fields.NvmRecordOffset -= gNvLegacyOffset_c;
                }
#endif
                /* write the meta */
                if (kStatus_HAL_Flash_Success !=
                    HAL_FlashProgram(mNvVirtualPageProperty[dstPageId].NvRawSectorStartAddress + offset,
                                     sizeof(NVM_RecordMetaInfo_t), (uint8_t *)&meta))
                {
                    status = gNVM_Error_c;
                    break;
                }
                offset += (uint16_t)sizeof(NVM_RecordMetaInfo_t);
                read_address += sizeof(NVM_RecordMetaInfo_t);
            }

            if (gNVM_OK_c == status)
            {
                status = UpgradeLegacyTableToFlash(read_address, dstPageId, tableData, legacy_page_counter,
                                                   last_record_offset);
            }
        }
    }
    return status;
}
#endif /* gNvLegacyTable_Disabled_d */
/******************************************************************************
 * Name: NvGetEntryFromDataPtr
 * Description: get table and element indexes based on a generic pointer address
 * Parameter(s): [IN] pData - a pointer to a NVM RAM table
 *               [OUT] pIndex - a pointer to a memory location where the
 *                              requested indexed will be stored
 * Return: gNVM_NullPointer_c - if the provided pointer is NULL
 *         gNVM_PointerOutOfRange_c - if the provided pointer cannot be founded
 *                                    within the RAM table
 *         gNVM_OK_c - if the operation completed successfully
 *****************************************************************************/
NVM_STATIC NVM_Status_t NvGetEntryFromDataPtr(void *pData, NVM_TableEntryInfo_t *pIndex)
{
    uint16_t     idx    = 0;
    NVM_Status_t status = gNVM_PointerOutOfRange_c;

    while (idx < mNVM_DataTableNbEntries)
    {
        if (((uint8_t *)pData >= (uint8_t *)pNVM_DataTable[idx].pData))
        {
#if gUnmirroredFeatureSet_d
            if (gNVM_MirroredInRam_c != (NVM_DataEntryType_t)pNVM_DataTable[idx].DataEntryType)
            {
                if ((uint8_t *)pData <
                    ((uint8_t *)pNVM_DataTable[idx].pData + (sizeof(void *) * pNVM_DataTable[idx].ElementsCount)))
                {
                    int32_t offset       = (uint8_t *)pData - (uint8_t *)pNVM_DataTable[idx].pData;
                    int32_t index        = offset / ((int32_t)sizeof(void *));
                    pIndex->elementIndex = (uint16_t)index;
                    pIndex->entryId      = pNVM_DataTable[idx].DataEntryID;
                    status               = gNVM_OK_c;
                    break;
                }
                idx++;
                continue;
            }
            else
#endif
                if ((uint8_t *)pData < ((uint8_t *)pNVM_DataTable[idx].pData +
                                        (pNVM_DataTable[idx].ElementSize * pNVM_DataTable[idx].ElementsCount)))
            {
                int32_t offset       = (uint8_t *)pData - (uint8_t *)pNVM_DataTable[idx].pData;
                pIndex->elementIndex = (uint16_t)offset / pNVM_DataTable[idx].ElementSize;
                pIndex->entryId      = pNVM_DataTable[idx].DataEntryID;
                status               = gNVM_OK_c;
                break;
            }
            else
            {
                /*MISRA rule 15.7*/
            }
        }
        /* increment the loop counter */
        idx++;
    }
    return status;
}
/******************************************************************************
 * Name: NvGetTableEntryIndexFromDataPtr
 * Description: get table and element indexes based on a generic pointer address
 * Parameter(s): [IN] pData - a pointer to a NVM RAM table
 *               [OUT] pIndex - a pointer to a memory location where the
 *                              requested indexed will be stored
 *               [OUT] pTableEntryIdx - a pointer to a memory location where the
 *                              requested TableEntry Idx will be stored
 * Return: gNVM_NullPointer_c - if the provided pointer is NULL
 *         gNVM_PointerOutOfRange_c - if the provided pointer cannot be founded
 *                                    within the RAM table
 *         gNVM_OK_c - if the operation completed successfully
 *****************************************************************************/
NVM_STATIC NVM_Status_t NvGetTableEntryIndexFromDataPtr(void *                pData,
                                                        NVM_TableEntryInfo_t *pIndex,
                                                        uint16_t *            pTableEntryIdx)
{
    NVM_Status_t status = gNVM_InvalidTableEntry_c;
    /* Get entry from the dataPtr */
    status = NvGetEntryFromDataPtr(pData, pIndex);

    if (gNVM_OK_c == status)
    {
        assert(gNvInvalidDataEntry_c != pIndex->entryId);
        if (pTableEntryIdx != NULL)
        {
            /* Get table entry index from id */
            *pTableEntryIdx = NvGetTableEntryIndexFromId(pIndex->entryId);
            assert(gNvInvalidTableEntryIndex_c != *pTableEntryIdx);
        }
    }
    return status;
}
/******************************************************************************
 * Name: NvMetaAndRecordAddressRegulate
 * Description: Performs to regulate
 * Parameter(s): [IN] pageFreeSpace - free space in active page
 *               [IN] totalRecordSize - the size of meta + record
 *               [IN] realRecordSize - the size of record aligned to Flash write size
 *               [IN] metaInfoAddress - the address of meta info will write to
 *               [IN] newRecordAddress - the address of record info will write to
 * Return: the status of the operation
 *****************************************************************************/
NVM_STATIC bool_t NvMetaAndRecordAddressRegulate(uint32_t  pageFreeSpace,
                                                 uint32_t  totalRecordSize,
                                                 uint32_t  realRecordSize,
                                                 uint32_t *metaInfoAddress,
                                                 uint32_t *newRecordAddress)
{
    NVM_RecordMetaInfo_t metaInfo = {0};
    uint32_t             lastRecordAddress;
    bool_t               doWrite = FALSE;

    *metaInfoAddress = mNvVirtualPageProperty[mNvActivePageId].NvLastMetaInfoAddress;

    if (gEmptyPageMetaAddress_c == *metaInfoAddress)
    {
        /* empty page, first write */

        /* set new record address */
        *newRecordAddress = mNvVirtualPageProperty[mNvActivePageId].NvRawSectorEndAddress - sizeof(NVM_TableInfo_t) -
                            realRecordSize + 1U;

        /* gEmptyPageMetaAddress_c is not a valid address and it is used only as an empty page marker;
         * therefore, set the valid value of meta information address */
        *metaInfoAddress = mNvVirtualPageProperty[mNvActivePageId].NvRawSectorStartAddress + gNvFirstMetaOffset_c;
    }
    else
    {
/* get the meta information of the last successfully written record */
#if gUnmirroredFeatureSet_d
        (void)NvGetMetaInfo(mNvActivePageId, mNvVirtualPageProperty[mNvActivePageId].NvLastMetaUnerasedInfoAddress,
                            &metaInfo);
#else
        /* get the last record start address (the address is always aligned) */
        (void)NvGetMetaInfo(mNvActivePageId, *metaInfoAddress, &metaInfo);
#endif
        lastRecordAddress =
            mNvVirtualPageProperty[mNvActivePageId].NvRawSectorStartAddress + metaInfo.fields.NvmRecordOffset;
        /* set new record address */
        *newRecordAddress = lastRecordAddress - realRecordSize;

        *metaInfoAddress += sizeof(NVM_RecordMetaInfo_t);
    }

    /* make sure there is at least a free space for a meta between the last one and the data*/
    while (totalRecordSize + sizeof(NVM_RecordMetaInfo_t) < pageFreeSpace)
    {
        /* check if the space for the record is free */
        if ((FALSE == NvIsMemoryAreaAvailable(*newRecordAddress, realRecordSize) && (realRecordSize != 0u)))
        {
            /* the memory space is not blank */
            if (pageFreeSpace < realRecordSize)
            {
                /* I am unable to write the record on this page, trigger copy page */
                break;
            }
            pageFreeSpace -= realRecordSize;
            *newRecordAddress -= realRecordSize;
        }
        /* check if the space for the meta is free */
        else if (!NvIsMemoryAreaAvailable(*metaInfoAddress, sizeof(NVM_RecordMetaInfo_t)))
        {
            /* the memory space is not blank */
            if (pageFreeSpace < realRecordSize)
            {
                /* I am unable to write the meta on this page, trigger copy page */
                break;
            }
            pageFreeSpace -= sizeof(NVM_RecordMetaInfo_t);
            *metaInfoAddress += sizeof(NVM_RecordMetaInfo_t);
        }
        else
        {
            /* the memory space is blank */
            doWrite = TRUE;
            break;
        }
    }

