benjaminkravets/KW45B41Z/kw45b41zevk_eatt_central_bm/framework/NVM/source/NV_Flash.c
    return doWrite;
}

/******************************************************************************
 * Name: NvWriteRecord
 * Description: writes a record
 * Parameter(s): [IN] tblIndexes - a pointer to table and element indexes
 *               [IN] tableEntryIdx - the table EntryIdx
 *               [IN] metaInfo - the meta infomation
 *               [IN] metaInfoAddress - the address of meta info will write to
 *               [IN] newRecordAddress - the address of record info will write to
  *              [IN] recordSize - the address of record will write to
 *               [IN] mirroredSrcAddress - the mirrored source address of will write to
 * Return: the status of the operation

 *****************************************************************************/
NVM_STATIC NVM_Status_t NvWriteRecordToFlash(NVM_TableEntryInfo_t *tblIndexes,
                                             uint16_t              tableEntryIdx,
                                             NVM_RecordMetaInfo_t  metaInfo,
                                             uint32_t              metaInfoAddress,
                                             uint32_t              newRecordAddress,
                                             uint32_t              recordSize,
                                             uint32_t              mirroredSrcAddress)
{
    NVM_Status_t status = gNVM_OK_c;
    uint32_t     srcAddress;

#if gUnmirroredFeatureSet_d
    if (gNVM_MirroredInRam_c != (NVM_DataEntryType_t)pNVM_DataTable[tableEntryIdx].DataEntryType)
    {
        srcAddress = (uint32_t)(uint8_t *)((uint8_t **)pNVM_DataTable[tableEntryIdx].pData)[tblIndexes->elementIndex];
    }
    else
#endif
    {
        srcAddress = mirroredSrcAddress;
    }

#if gUnmirroredFeatureSet_d
    if (0U == srcAddress)
    {
        /* It's an erased unmirrored dataset */
        metaInfo.fields.NvmRecordOffset = 0;
    }
    if (kStatus_HAL_Flash_Success ==
        ((srcAddress != 0U) ? HAL_FlashProgramUnaligned(newRecordAddress, recordSize, (uint8_t *)srcAddress) :
                              kStatus_HAL_Flash_Success))
#else
    if (kStatus_HAL_Flash_Success == HAL_FlashProgramUnaligned(newRecordAddress, recordSize, (uint8_t *)srcAddress))
#endif
    {
        /* record successfully written, now write the associated record meta information */
        if (kStatus_HAL_Flash_Success ==
            HAL_FlashProgram(metaInfoAddress, sizeof(NVM_RecordMetaInfo_t), (uint8_t *)(&metaInfo)))
        {
            /* update the last record meta information */
            mNvVirtualPageProperty[mNvActivePageId].NvLastMetaInfoAddress = metaInfoAddress;
/* update the last unerased meta info address */
#if gUnmirroredFeatureSet_d
            if (0u != metaInfo.fields.NvmRecordOffset)
            {
                mNvVirtualPageProperty[mNvActivePageId].NvLastMetaUnerasedInfoAddress = metaInfoAddress;
            }
#endif
/* Empty macro when nvm monitoring is not enabled */
#if (((defined(gFsciIncluded_c)) && (gFsciIncluded_c > 0U)) && \
     ((defined(gNvmEnableFSCIMonitoring_c)) && (gNvmEnableFSCIMonitoring_c > 0U)))
            FSCI_MsgNVWriteMonitoring(metaInfo.fields.NvmDataEntryID, tblIndexes->elementIndex,
                                      (tblIndexes->op_type == OP_SAVE_ALL) ? TRUE : FALSE);
#endif

#if gUnmirroredFeatureSet_d
            if (gNVM_MirroredInRam_c != (NVM_DataEntryType_t)pNVM_DataTable[tableEntryIdx].DataEntryType)
            {
                if (0u != metaInfo.fields.NvmRecordOffset)
                {
                    uint8_t *pTempAddress =
                        (uint8_t *)((uint8_t **)pNVM_DataTable[tableEntryIdx].pData)[tblIndexes->elementIndex];
                    ((uint8_t **)pNVM_DataTable[tableEntryIdx].pData)[tblIndexes->elementIndex] =
                        (uint8_t *)newRecordAddress;
                    (void)MEM_BufferFree(pTempAddress);
                }
            }
#endif
            status = gNVM_OK_c;
        }
        else
        {
            status = gNVM_MetaInfoWriteError_c;
        }
    }
    else
    {
        status = gNVM_RecordWriteError_c;
    }
    return status;
}

/******************************************************************************
 * Name: NvWriteRecord
 * Description: writes a record
 * Parameter(s): [IN] tblIndexes - a pointer to table and element indexes
 * Return: gNVM_InvalidPageID_c - if the active page is not valid
 *         gNVM_NullPointer_c - if the provided pointer is NULL
 *         gNVM_MetaInfoWriteError_c - if the meta information couldn't be
 *                                     written
 *         gNVM_RecordWriteError_c - if the record couldn't be written
 *         gNVM_OK_c - if the operation completed successfully
 *****************************************************************************/
NVM_STATIC NVM_Status_t NvWriteRecord(NVM_TableEntryInfo_t *tblIndexes)
{
    uint32_t             metaInfoAddress;
    uint32_t             newRecordAddress;
    NVM_RecordMetaInfo_t metaInfo;
    uint32_t             realRecordSize;
    uint32_t             totalRecordSize; /* record + meta */
    uint32_t             pageFreeSpace;
    bool_t               doWrite;
    uint32_t             mirroredSrcAddress;
    uint8_t              nvValidationStartByte;
    uint8_t              nvValidationEndByte;
#if gUnmirroredFeatureSet_d
    bool_t ret = FALSE;
#endif

    NVM_Status_t status = gNVM_OK_c;
    uint16_t     tableEntryIdx;
    uint32_t     recordSize;

    tableEntryIdx = NvGetTableEntryIndexFromId(tblIndexes->entryId);

    if (gNvInvalidTableEntryIndex_c == tableEntryIdx)
    {
        status = gNVM_InvalidTableEntry_c;
    }
    else
    {
        /* make sure i don't process the save if page copy is active */
        if (mNvCopyOperationIsPending)
        {
            status = gNVM_PageCopyPending_c;
        }
        else
        {
#if gUnmirroredFeatureSet_d
            /* For data sets not mirrored in ram a table entry is saved separate */
            if (gNVM_MirroredInRam_c != (NVM_DataEntryType_t)pNVM_DataTable[tableEntryIdx].DataEntryType)
            {
                tblIndexes->op_type = OP_SAVE_SINGLE;
            }
#endif

            if (tblIndexes->op_type == OP_SAVE_ALL)
            {
                recordSize =
                    (uint32_t)pNVM_DataTable[tableEntryIdx].ElementSize * pNVM_DataTable[tableEntryIdx].ElementsCount;
                nvValidationStartByte = gValidationByteAllRecords_c;
                nvValidationEndByte   = gValidationByteAllRecords_c;
                mirroredSrcAddress    = (uint32_t)((uint8_t *)(((uint8_t *)(pNVM_DataTable[tableEntryIdx]).pData)));
            }
            else
            {
                recordSize            = pNVM_DataTable[tableEntryIdx].ElementSize;
                nvValidationStartByte = gValidationByteSingleRecord_c;
                nvValidationEndByte   = gValidationByteSingleRecord_c;
                mirroredSrcAddress    = (uint32_t)((uint8_t *)(((uint8_t *)(pNVM_DataTable[tableEntryIdx]).pData)) +
                                                (tblIndexes->elementIndex * pNVM_DataTable[tableEntryIdx].ElementSize));
            }
            realRecordSize = recordSize;

#if gUnmirroredFeatureSet_d
            /* Check if is an erase for unmirrored dataset*/
            if (gNVM_MirroredInRam_c != (NVM_DataEntryType_t)pNVM_DataTable[tableEntryIdx].DataEntryType)
            {
                if (NULL == ((void **)pNVM_DataTable[tableEntryIdx].pData)[tblIndexes->elementIndex])
                {
                    recordSize     = 0;
                    realRecordSize = 0;
                }
                /*if the dataset is allready in flash, ignore it*/
                else if (NvIsNVMFlashAddress(((void **)pNVM_DataTable[tableEntryIdx].pData)[tblIndexes->elementIndex]))
                {
                    /*it returns OK, because atomic save must not fail, this is not an error*/
                    status = gNVM_OK_c;
                    ret    = TRUE;
                }
                else
                {
                    /*MISRA rule 15.7*/
                }
            }
            if (FALSE == ret)
#endif
            {
                /* get active page free space */
                (void)NvGetPageFreeSpace(&pageFreeSpace);

