benjaminkravets/KW45B41Z/kw45b41zevk_eatt_central_bm/framework/NVM/source/NV_Flash.c
                /* compute the 'real record size' taking into consideration that the FTFL controller only writes in
                 * burst of 4 bytes */
                realRecordSize = NvUpdateSize(realRecordSize);

                /* compute the total size (record + meta info) */
                totalRecordSize = realRecordSize + sizeof(NVM_RecordMetaInfo_t);

                /* check if the record fits the page's free space.
                 * one extra meta info space must be kept always free, to be able to perform the meta info search */
                if (totalRecordSize + sizeof(NVM_RecordMetaInfo_t) > pageFreeSpace)
                {
                    /* there is no space to save the record, try to copy the current active page latest records
                     * to the other page
                     */
                    mNvCopyOperationIsPending = TRUE;
                    status                    = gNVM_PageCopyPending_c;
                }
                else
                {
                    /* check if the space needed by the record is really free (erased).
                     * this check is necessary because it may happens that a record to be successfully written,
                     * but the system fails (e.g. POR) before the associated meta information has been written.
                     * the theoretically free space is computed as the difference between the last meta info
                     * address and the start address of the last successfully written record. This information
                     * is valuable but may not reflect the reality, as mentioned in the explanation above */
                    doWrite = NvMetaAndRecordAddressRegulate(pageFreeSpace, totalRecordSize, realRecordSize,
                                                             &metaInfoAddress, &newRecordAddress);

                    /* set associated meta info */
                    metaInfo.fields.NvValidationStartByte = nvValidationStartByte;
                    metaInfo.fields.NvValidationEndByte   = nvValidationEndByte;
                    metaInfo.fields.NvmDataEntryID        = pNVM_DataTable[tableEntryIdx].DataEntryID;
                    metaInfo.fields.NvmElementIndex       = tblIndexes->elementIndex;
                    metaInfo.fields.NvmRecordOffset =
                        (uint16_t)(newRecordAddress - mNvVirtualPageProperty[mNvActivePageId].NvRawSectorStartAddress);

                    /* the offset has to be 4 bytes aligned, an extra check is performed to avoid further hard faults
                     * caused by FTFx controller */
                    if ((metaInfo.fields.NvmRecordOffset & (uint16_t)0x3) != 0u)
                    {
                        status = gNVM_AlignamentError_c;
                    }
                    else
                    {
                        /* Write the record and associated meta information */
                        if (FALSE == doWrite)
                        {
                            /* there is no space to save the record, try to copy the current active page latest records
                             * to the other page
                             */
                            mNvCopyOperationIsPending = TRUE;
                            status                    = gNVM_PageCopyPending_c;
                        }
                        else
                        {
                            status = NvWriteRecordToFlash(tblIndexes, tableEntryIdx, metaInfo, metaInfoAddress,
                                                          newRecordAddress, recordSize, mirroredSrcAddress);
                        }
                    }
                }
            }
        }
    }

    return status;
}

/******************************************************************************
 * Name: NvRestoreData
 * Description: restore an element from NVM storage to its original RAM location
 * Parameter(s): [IN] tblIdx - pointer to table and element indexes
 * Return: gNVM_NullPointer_c - if the provided pointer is NULL
 *         gNVM_PageIsEmpty_c - if page is empty
 *         gNVM_Error_c - in case of error(s)
 *         gNVM_OK_c - if the operation completed successfully
 *****************************************************************************/
NVM_STATIC NVM_Status_t NvRestoreData(NVM_TableEntryInfo_t *tblIdx)
{
    NVM_Status_t         status   = gNVM_MetaNotFound_c;
    NVM_RecordMetaInfo_t metaInfo = {0};
    uint32_t             metaInfoAddress;
#if gNvFragmentation_Enabled_d
    uint16_t cnt;
#endif
    uint16_t tableEntryIdx;

    tableEntryIdx = NvGetTableEntryIndexFromId(tblIdx->entryId);

    if (gNvInvalidTableEntryIndex_c == tableEntryIdx)
    {
        status = gNVM_InvalidTableEntry_c;
    }
    else
    {
        /* get the last meta information address */
        metaInfoAddress = mNvVirtualPageProperty[mNvActivePageId].NvLastMetaInfoAddress;
        if (metaInfoAddress == gEmptyPageMetaAddress_c)
        {
            /* blank page, no data to restore */
            status = gNVM_PageIsEmpty_c;
        }
        else
        {
            if (tblIdx->entryId == gNvInvalidDataEntry_c)
            {
                /* invalid table entry */
                status = gNVM_InvalidTableEntry_c;
            }
            else
            {
                /*
                 * If the meta info is found, the associated record is restored,
                 * otherwise the gNVM_MetaNotFound_c will be returned
                 */
                status = gNVM_MetaNotFound_c;
#if gNvFragmentation_Enabled_d
                /* clear the buffer */
                FLib_MemSet(maNvRecordsCpyOffsets, 0,
                            (uint32_t)sizeof(uint16_t) * pNVM_DataTable[tableEntryIdx].ElementsCount);
#endif
                /* parse meta info backwards */
                while (metaInfoAddress >=
                       (mNvVirtualPageProperty[mNvActivePageId].NvRawSectorStartAddress + gNvFirstMetaOffset_c))
                {
                    /* get the meta information */
                    (void)NvGetMetaInfo(mNvActivePageId, metaInfoAddress, &metaInfo);

