benjaminkravets/KW45B41Z/kw45b41zevk_eatt_central_bm/framework/NVM/source/NV_Flash.c
                    if (metaInfo.fields.NvValidationStartByte != metaInfo.fields.NvValidationEndByte)
                    {
                        /* invalid meta info, move to the previous meta info */
                        metaInfoAddress -= sizeof(NVM_RecordMetaInfo_t);
                        continue;
                    }

                    if (metaInfo.fields.NvmDataEntryID == tblIdx->entryId)
                    {
                        if (tblIdx->op_type == OP_SAVE_ALL)
                        {
#if gNvFragmentation_Enabled_d
                            /* single save found */
                            if ((metaInfo.fields.NvValidationStartByte == gValidationByteSingleRecord_c) &&
                                (0u == maNvRecordsCpyOffsets[metaInfo.fields.NvmElementIndex]))
                            {
                                maNvRecordsCpyOffsets[metaInfo.fields.NvmElementIndex] = 1;
                                NV_FlashRead(
                                    (uint8_t *)mNvVirtualPageProperty[mNvActivePageId].NvRawSectorStartAddress +
                                        metaInfo.fields.NvmRecordOffset,
                                    (uint8_t *)pNVM_DataTable[tableEntryIdx].pData +
                                        metaInfo.fields.NvmElementIndex * pNVM_DataTable[tableEntryIdx].ElementSize,
                                    pNVM_DataTable[tableEntryIdx].ElementSize);
                                status = gNVM_OK_c;
                            }
                            /* full save found */
                            else if (metaInfo.fields.NvValidationStartByte == gValidationByteAllRecords_c)
                            {
                                for (cnt = 0; cnt < pNVM_DataTable[tableEntryIdx].ElementsCount; cnt++)
                                {
                                    /* skip allready restored elements */
                                    if (1U == maNvRecordsCpyOffsets[cnt])
                                    {
                                        continue;
                                    }
                                    NV_FlashRead(
                                        (uint8_t *)mNvVirtualPageProperty[mNvActivePageId].NvRawSectorStartAddress +
                                            metaInfo.fields.NvmRecordOffset +
                                            cnt * pNVM_DataTable[tableEntryIdx].ElementSize,
                                        (uint8_t *)pNVM_DataTable[tableEntryIdx].pData +
                                            cnt * pNVM_DataTable[tableEntryIdx].ElementSize,
                                        pNVM_DataTable[tableEntryIdx].ElementSize);
                                }
                                status = gNVM_OK_c;
                                break;
                            }
                            else
                            {
                                /*MISRA rule 15.7*/
                            }
#else
                            /* single saves are not allowed if fragmentation is off */
                            if (metaInfo.fields.NvValidationStartByte == gValidationByteSingleRecord_c)
                            {
                                status = gNVM_FragmentatedEntry_c;
                                break;
                            }

                            NV_FlashRead(mNvVirtualPageProperty[mNvActivePageId].NvRawSectorStartAddress +
                                             metaInfo.fields.NvmRecordOffset,
                                         (uint8_t *)pNVM_DataTable[tableEntryIdx].pData,
                                         (uint32_t)pNVM_DataTable[tableEntryIdx].ElementsCount *
                                             (uint32_t)pNVM_DataTable[tableEntryIdx].ElementSize);
                            status = gNVM_OK_c;
                            break;
#endif
                        }
                        else
                        {
                            if (metaInfo.fields.NvValidationStartByte == gValidationByteSingleRecord_c &&
                                metaInfo.fields.NvmElementIndex == tblIdx->elementIndex)
                            {
#if gUnmirroredFeatureSet_d
                                if (gNVM_MirroredInRam_c !=
                                    (NVM_DataEntryType_t)pNVM_DataTable[tableEntryIdx].DataEntryType)
                                {
                                    if (0u == metaInfo.fields.NvmRecordOffset)
                                    {
                                        ((uint8_t **)pNVM_DataTable[tableEntryIdx].pData)[tblIdx->elementIndex] = NULL;
                                    }
                                    else
                                    {
                                        ((uint8_t **)pNVM_DataTable[tableEntryIdx].pData)[tblIdx->elementIndex] =
                                            (uint8_t *)mNvVirtualPageProperty[mNvActivePageId].NvRawSectorStartAddress +
                                            metaInfo.fields.NvmRecordOffset;
                                    }
                                    status = gNVM_OK_c;
                                    break;
                                }
                                else
#endif
                                {
                                    /* restore the element */
                                    NV_FlashRead(
                                        (uint8_t *)mNvVirtualPageProperty[mNvActivePageId].NvRawSectorStartAddress +
                                            metaInfo.fields.NvmRecordOffset,
                                        (uint8_t *)((uint8_t *)pNVM_DataTable[tableEntryIdx].pData +
                                                    (metaInfo.fields.NvmElementIndex *
                                                     pNVM_DataTable[tableEntryIdx].ElementSize)),
                                        pNVM_DataTable[tableEntryIdx].ElementSize);
                                    status = gNVM_OK_c;
                                    break;
                                }
                            }

                            if (metaInfo.fields.NvValidationStartByte == gValidationByteAllRecords_c)
                            {
                                /* restore the single element from the entire table entry record */
                                NV_FlashRead(
                                    (uint8_t *)(mNvVirtualPageProperty[mNvActivePageId].NvRawSectorStartAddress +
                                                metaInfo.fields.NvmRecordOffset +
                                                (tblIdx->elementIndex * pNVM_DataTable[tableEntryIdx].ElementSize)),
                                    ((uint8_t *)pNVM_DataTable[tableEntryIdx].pData +
                                     (tblIdx->elementIndex * pNVM_DataTable[tableEntryIdx].ElementSize)),
                                    pNVM_DataTable[tableEntryIdx].ElementSize);
                                status = gNVM_OK_c;
                                break;
                            }
                        }
                    }
                    /* move to the previous meta info */
                    metaInfoAddress -= sizeof(NVM_RecordMetaInfo_t);
                }
            }
        }
    }
    return status;
}

