benjaminkravets/KW45B41Z/kw45b41zevk_eatt_central_bm/framework/NVM/source/NV_Flash.c
/******************************************************************************
 * Name: NvGetTableEntryIndex
 * Description: get the table entry index from the provided ID
 * Parameter(s): [IN] entryId - the ID of the table entry
 * Return: table entry index of gNvInvalidTableEntryIndex_c
 *****************************************************************************/
NVM_STATIC uint16_t NvGetTableEntryIndexFromId(NvTableEntryId_t entryId)
{
    uint16_t loopCnt = 0;

    while (loopCnt < mNVM_DataTableNbEntries)
    {
        if (pNVM_DataTable[loopCnt].DataEntryID == entryId)
        {
            break;
        }
        /* increment the loop counter */
        loopCnt++;
    }
    if (mNVM_DataTableNbEntries == loopCnt)
    {
        loopCnt = gNvInvalidTableEntryIndex_c;
    }
    return loopCnt;
}

/******************************************************************************
 * Name: NvProcessFirstSaveInQueue
 * Description: processes the first save in the queue so that the queue can accept another entry
 * Parameter(s): -
 * Return: TRUE if a save has been processed, ELSE otherwise
 *****************************************************************************/
NVM_STATIC NVM_Status_t NvProcessFirstSaveInQueue(NVM_TableEntryInfo_t *ptrTblIdx)
{
    NVM_TableEntryInfo_t tblIdx;
    NVM_Status_t         status = gNVM_OK_c;

    if (0U == mNvCriticalSectionFlag)
    {
        if (NvIsPendingOperation())
        {
            while (NvPopPendingSave(&mNvPendingSavesQueue, &tblIdx))
            {
                /* save tblIdx */
                *ptrTblIdx = tblIdx;
                if ((gNvCopyAll_c == tblIdx.entryId) && (gNvCopyAll_c == tblIdx.elementIndex) &&
                    (OP_SAVE_ALL == tblIdx.op_type))
                {
                    status = gNVM_AtomicSaveRecursive_c;
                    break;
                }
                else if (gNvInvalidDataEntry_c == tblIdx.entryId)
                {
                    continue;
                }
                else
                {
                    /*MISRA rule 15.7*/
                }

                if (NvWriteRecord(&tblIdx) == gNVM_PageCopyPending_c)
                {
#if (((defined(gFsciIncluded_c)) && (gFsciIncluded_c > 0U)) && \
     ((defined(gNvmEnableFSCIMonitoring_c)) && (gNvmEnableFSCIMonitoring_c > 0U)))
                    FSCI_MsgNVVirtualPageMonitoring(TRUE, gNVM_OK_c);
                    FSCI_MsgNVVirtualPageMonitoring(FALSE, status = NvCopyPage(gNvCopyAll_c));
#else
                    status = NvCopyPage(gNvCopyAll_c);
#endif
                    if (gNVM_OK_c == status)
                    {
                        mNvCopyOperationIsPending = FALSE;
                    }
                    if (gNVM_OK_c == NvWriteRecord(&tblIdx))
                    {
                        status = gNVM_OK_c;
                        break;
                    }
                    else
                    {
                        /* return gNVM_SaveRequestRecursive_c to run again */
                        status = gNVM_SaveRequestRecursive_c;
                        break;
                    }
                }
                else
                {
                    status = gNVM_OK_c;
                    break;
                }
            }
        }
    }
    return status;
}

/******************************************************************************
 * Name: NvAddSaveRequestToQueue
 * Description: Add save request to save requests queue; if the request is
 *              already stored, ignore the current request
 * Parameter(s): [IN] ptrTblIdx - pointer to table index
 * Return: gNVM_OK_c - if operation completed successfully
 *         gNVM_SaveRequestRejected_c - if the request couldn't be queued
 ******************************************************************************/
NVM_STATIC NVM_Status_t NvAddSaveRequestToQueue(NVM_TableEntryInfo_t *ptrTblIdx)
{
    uint8_t              loopIdx;
    bool_t               isQueued       = FALSE;
    bool_t               isInvalidEntry = FALSE;
    uint8_t              lastInvalidIdx = 0;
    uint8_t              remaining_count;
    NVM_Status_t         status   = gNVM_OK_c;
    NVM_TableEntryInfo_t nvTblIdx = *ptrTblIdx;
    NVM_TableEntryInfo_t preNvTblIdx;

    do
    {
        if (mNvPendingSavesQueue.EntriesCount == 0u)
        {
            /* add request to queue */
            if (FALSE == NvPushPendingSave(&mNvPendingSavesQueue, nvTblIdx))
            {
                status = gNVM_SaveRequestRejected_c;
            }
        }
        else
        {
            /* start from the queue's head */
            loopIdx = (uint8_t)mNvPendingSavesQueue.Head;

            remaining_count = (uint8_t)mNvPendingSavesQueue.EntriesCount;
            /* check if the request is not already stored in queue */
            while (remaining_count != 0u)
            {
                if (nvTblIdx.entryId == mNvPendingSavesQueue.QData[loopIdx].entryId)
                {
                    if (mNvPendingSavesQueue.QData[loopIdx].op_type ==
                        OP_SAVE_ALL) /* full table entry already queued */
                    {
                        /* request is already queued */
                        isQueued = TRUE;
                        break;
                    }

                    /* single element from table entry is queued */
                    if (nvTblIdx.op_type == OP_SAVE_ALL) /* a full table entry is requested to be saved */
                    {
                        /* update only the flag of the already queued request */
                        mNvPendingSavesQueue.QData[loopIdx].op_type = OP_SAVE_ALL;
                        /* request is already queued */
                        isQueued = TRUE;
                        break;
                    }

                    /* The request is for a single element and the queued request is also for a single element;
                     * Check if the request is for the same element. If the request is for a different element,
                     * add the new request to queue.
                     */
                    if (nvTblIdx.elementIndex == mNvPendingSavesQueue.QData[loopIdx].elementIndex)
                    {
                        /* request is already queued */
                        isQueued = TRUE;
                        break;
                    }
                }
                /* Check if in the queue is an invalid entryId that can be used*/
                if ((gNvInvalidDataEntry_c == mNvPendingSavesQueue.QData[loopIdx].entryId) && (isInvalidEntry == FALSE))
                {
                    isInvalidEntry = TRUE;
                    lastInvalidIdx = loopIdx;
                }
                remaining_count--;
                /* increment and wrap the loop index */
                if (++loopIdx >= (uint8_t)gNvPendingSavesQueueSize_c)
                {
                    loopIdx = 0;
                }
            }

            if (!isQueued)
            {
                /* Reuse an invalid entry from the queue*/
                if (TRUE == isInvalidEntry)
                {
                    mNvPendingSavesQueue.QData[lastInvalidIdx] = nvTblIdx;
                }
                else
                {
                    /* push the request to save operation pending queue */
                    if (!NvPushPendingSave(&mNvPendingSavesQueue, nvTblIdx))
                    {
                        preNvTblIdx = nvTblIdx;
                        /* free a space */
                        status = NvProcessFirstSaveInQueue(&nvTblIdx);
                        if (!NvPushPendingSave(&mNvPendingSavesQueue, preNvTblIdx))
                        {
                            status = gNVM_SaveRequestRejected_c;
                        }
                    }
                }
            }
        }
    } while (status == gNVM_SaveRequestRecursive_c);
    return status;
}

